[{"repo": "flexboxfroggy", "type": "elite", "title": "", "number of text": 135, "text": "  Hey @pavelbelousov, appreciate the fix!  @Akirtovskis, thanks for the speedy translations to the new settings! Looks like an unclosed `code` tag along with the `p` tag. I'll push a fix for it now.  @LHSnow, thanks for the bug report. Fix on the way.  Hey @Akirtovskis, welcome to the open source world and thanks for your contribution!\r\n\r\nAdding a comma will display like that so no need to worry or do anything different. The translation looks good, but there are a few spots in `levels.js` where you added a line return in the middle of the string:\r\n\r\n* [line 75](https://github.com/thomaspark/flexboxfroggy/pull/135/files#diff-118461f2d0f90667d59f0beb7dc2deabR75)\r\n* [line 196](https://github.com/thomaspark/flexboxfroggy/pull/135/files#diff-118461f2d0f90667d59f0beb7dc2deabR196)\r\n* [line 843](https://github.com/thomaspark/flexboxfroggy/pull/135/files#diff-118461f2d0f90667d59f0beb7dc2deabR843)\r\n\r\nCan you delete the returns so all the text is on a single line? You make make a new commit for it, then I'll merge in your work. Let me know if you have any questions. Looks like you missed one at line 841. Otherwise looks ready to go! Perfect, I'll merge this in now. Honored to have our project be your first PR. Nice work! You might need to flush your browser cache to get it to show.  Hey @ajrussellaudio, thanks for your work on this. We've gotten many requests for a color blind mind so this is a welcome and overdue feature. Everything looks great.\r\n\r\nJust one small tweak. The real estate is tight as it is, so could you restyle the toggle color blind mode button to match the language menu, and place it inline to the right of it in the footer? Looks great. Let's merge it in!  Thanks MeenChul!  Looks great David, thanks for the translation!  Thanks, assuming this will fix the tooltip issue with the hard mode PR though?  Hey @mcshiz, thanks for this pull request, looks good and I love the idea of randomizing levels on top of hiding the instructions.\r\n\r\nOne issue is that it won't be immediately obvious what the different levels do. How about if we do a pop-up (like for languages) for Beginner/Intermediate/Advanced with short descriptions of what each does. Would you be up for working on that? The menu looks great, just what I was hoping for.\r\n\r\nI noticed a new bug with the padding of the properties tooltips. Aside from that, it looks good to go.\r\n\r\n<img width=\"295\" alt=\"screen shot 2018-02-03 at 5 50 17 pm\" src=\"https://user-images.githubusercontent.com/900407/35772370-e92fe6a8-090a-11e8-8eb9-6e074abc6952.png\">\r\n  Merged!  Hey @joykuotw, thanks for refining the translations. Grateful for your efforts!  @diabloevagto, thanks for the translation!  👏 👏 👏  Thanks @shuuji3!  Thanks for the correction @not0000!  @lmintmate, looks great, thanks for this translation. I'll merge it in now!  @kant, thanks for the fixes!  Can't replicate this on Firefox 56 on Mac. Could you try disabling your add-ons and see if it's still a problem? Thanks.  @laurensclaessen, much appreciate the translation!  Many thanks for the tweaks, @tuanphpvn.  @BoyWithSilverWings, thanks for the translation, glad to add Malayalam to the list. Will also add you to the readme. 😃   Thank you sir. 👍   Hey @Repjarms, looks like that gap shows up due to rounding error. Would love a PR on this!  @LittaPanda, thanks for the bug report. Does it happen when you run Froggy in incognito mode? How about if you clear browser data for flexboxfroggy.com? Any reason the Parse script at https://unpkg.com/parse@1.9.2/dist/parse.min.js might not be loading? Maybe a browser extension is blocking it?  Hoping to add this feature eventually, but in the meantime, Programming Mentor has put together this nice guide:\r\n\r\nhttp://programmingmentor.com/post/playing-css-grid-garden/  Hey @SherylHohman, thanks for your comments. Point well taken about level 14 causing misconceptions about how `order` works. I'll look into tweaking something like the order of the levels or adding a clue to the level 15 instructions to help people get unstuck.\r\n\r\nThere are a couple of things that help with this right now though. First is players can freely move back and forth between levels to review earlier info. Second is that you can hover underlined properties to get similar info. For `order`, it also gives you example values:\r\n\r\n<img width=\"442\" alt=\"screen shot 2017-07-26 at 10 38 16 am\" src=\"https://user-images.githubusercontent.com/900407/28627020-9c35297a-71ee-11e7-8455-727d00ddc5f8.png\">\r\n\r\nYour suggestion in #110 to add hints or solutions would also help deal with this.  Hey @neotan, thanks for the refinements!  Hey @pckltr, looks good, but can you keep the languages on `index.html` in the original order and add Romanian after Magyar? They're roughly ordered by geography so similar languages can be grouped together. Thanks!  @leonine90, thanks for the tweaks, and again for your work on translating [Grid Garden](https://github.com/thomaspark/gridgarden)!  Hey @ocelotluke, thanks for your thoughtful suggestions. I'm very open to the idea of providing supplemental materials, which could take many different forms.\r\n\r\nThe GitHub wiki might be a good way to collaborate on this. Pages can be created for per-level explanations as well as a cheat sheet that explains in more detail the different properties/values, and also links to additional resources. And then we could link back from Froggy to the individual wiki pages where relevant. Downside of this is that when Froggy is used as a class activity, students can just copy & paste answers from the wiki instead of working through it.\r\n\r\nOr we could have the explanations more deeply integrated with the game. Make full explanations only available when a level is completed.\r\n\r\nI have gotten notes from people that they use Froggy as an interactive reference. They go back to specific levels and experiment with different values to get a better grasp on a certain property. Maybe if the levels had descriptions (e.g., hover over a number in the level menu to get a tooltip of its topic), it could help this use case.   @ivandevp, thanks for the corrections. 😄   Sure, you can hit the reset link here to clear everything out:\r\n\r\n<img width=\"246\" alt=\"screen shot 2017-04-09 at 5 43 11 pm\" src=\"https://cloud.githubusercontent.com/assets/900407/24841193/0f2d4914-1d4c-11e7-98ce-2e5ce19a6d23.png\">\r\n  Just spotted this missing Japanese string while working on the language menu:\r\nhttps://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/messages.js#L75\r\n\r\n@ginpei, would you be able to add it? Ah, thanks for the explanation, I had no idea. We can leave it as is then!  Awesome, thanks @gbhasha!  Thanks @peterver, looks good to me!  ![gridgarden](https://cloud.githubusercontent.com/assets/900407/24732242/b0689f02-1a3d-11e7-8168-8fb4a4d48951.png)\r\n\r\nJust put the finishing touches on Grid Garden:\r\n\r\nhttp://cssgridgarden.com/\r\nhttps://github.com/thomaspark/gridgarden\r\n\r\nLoved the Grid Giraffe idea but sadly couldn't get it to work. 😛  Turns out a carrot is much easier to draw than a giraffe!  Hey Danko, thanks for this! I'll do a more thorough review soon, but can you make one quick change? Change the language key from `ser` to `sr`, which is the [official ISO code](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) for Serbian. Thanks, just one more thing I spotted. You missed the translation at the end of `levels.js`: https://github.com/dankoknad/flexboxfroggy/blob/cba3379d25736cd68af64b76760cf8f60cab4e57/js/levels.js#L805\r\n\r\nOtherwise, looks good to go! Merged! Danko, much thanks for your contribution.  Hey Shubham, thanks for this, really glad to finally have a Hindi translation!  @KochetkovEgor, thanks for the fix!  Thanks @mihailgaberov.  Thanks Christian!  @mihailgaberov, thanks for contributing this translation!  Hey @coliff, thanks for this.  Hey @theJollySin, feel free to use the the images. I'm adding a note in the README that they are released under Creative Commons CC BY 3.0 license, which only requires attribution.  Hey @shadoll, this is looking great. Can you just switch the lang code to `uk`? While `ua` is used for country, `uk` is used for the language (https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes). Thanks!  I would definitely be open to something this. Maybe an alternate color palette, or giving the frogs different patterns. Other ideas?\n  Thanks Daniel for the pull request, I'm sure the examples will be a big help to some of the new coders out there!\n  Thanks for the suggestion, I'd be open to a PR for this. Maybe something as simple as a parenthetical with example numbers would be enough. This would be easy to add to all translations as well.\n\nSomething like:\n\n> ...we can use this property to set it to a positive or negative integer value. (...-2, -1, 0, 1, 2,...)\n  @zbtn, thanks for the corrections!\n  Thanks!\n  Hey Martin, thanks for the translation. Much appreciated!\n  Thanks Harvey. Looks great!\n  Works ok for me on Firefox 46.0.1. Are you seeing any errors in console?\n  Hey @sunsheeppoplar, thanks for this translation. Looks good to me.\n  Hi @dm-wyncode, the Hungarian translation was recently added. A bug is causing the new Hungarian instructions to overwrite English for levels 14 and 15. Thanks for your detailed report — I was able to track it down and will push a fix shortly.\n  Hi Adam, thanks so much for your translation. It looks ready to go!\n  @rankill, thanks for the typo fixes! But looks like you committed some unrelated changes since then.\n  Ok, will close this issue. Cheers.\n  @ginpei, thanks so much for this translation! I'll go ahead and merge this.\n\nAgree that CJK should be clustered together, but I can take care of this myself.\n  Hey @liberaliscomputing, I left a few comments on your PR. Thanks.\n  Thanks for the tweaks.\n  Thanks for the fix!\n  Thanks!\n  @MightyPork, thanks for the translation. Could you squash all of your changes into one single commit for the pull request?\n  @kingstenbanh, thank you!\n  @eLGi, thanks for the translation!\n  Thanks, this is great. But can you keep the PR to just the translation? Instead of adding gitignore to this project, I recommend setting up a [global gitignore](https://help.github.com/articles/ignoring-files/#create-a-global-gitignore).\n Merged in #55 \n  You should be able to just hit \"enter\" to submit your answer, but making it more semantic and accessible doesn't hurt. Pushing a change for this now. Thanks for the suggestion.\n  Thanks for the fix!\n  Awesome, thanks @justutiz!\n  Meen Chul, this is great. Thanks for your help.\n  Grazie!\n  Much appreciated!\n  Thanks for this.\n  Many thanks for this, @timguoqk!\n @timguoqk, just spotted that a translation for \"Level\" is missing here: https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/messages.js#L32\n\nCan you provide one?\n Ah, thanks for the clarification.\n  @alihaddadkar, this is awesome, thanks for it.\n  Thanks!\n  Wonderful. :smile: Thanks for the translation, @artem328.\n  How does something like #27 sound? Repeating the levels with the instructions toggled off.\n\nI was also thinking about a mode that generates levels with a random combination of properties.\n  Thanks, the whole thing is due for a refactor (see #24) but this is nice improvement in the meantime.\n  Hi @alihaddadkar, thanks for this. A few comments:\n- Changes to the CSS should be minimized. For example, if the Farsi displays ok without adding the custom font, it should be removed.\n- Likewise, there shouldn't be any changes to the HTML. Chances are we'll be moving to a single HTML doc soon, so they'll get wiped anyway. I do plan to add a README that will credit all of the translators' contributions.\n- To support interface changes for RTL (e.g., setting `direction: rtl;`, reversing the previous/next buttons), perhaps we can set a `rtl` class to body using JS and add styles using that.\n- There's also a bigger question about changes to the levels themselves. RTL means the horizontal axis of flexbox is also flipped. Allowing that to happen means the wording of the instructions may also need to be changed.\n To use Tahoma, you could try something like:\n\n```\nhtml[lang=\"fa\"] {\n  font-family: Tahoma, Geneva, Verdana, sans-serif;\n}\n```\n\nHow about applying RTL like this:\n\n```\n#instructions, #credits {\n  direction: rtl;\n}\n```\n\nBy the way, the language stuff has been reworked. There's just a single `index.html` file now, and all the translations can be made in the JS files.\n  This is fantastic. Thanks @manuelitox, for improving the Google Translate versions as well. :smile:\n   I'll be sure to tag you if any translations are need in the future. Thanks for the tweaks!\n  There are a few new Portuguese translations left to do.\n\nIn https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/messages.js:\n- \"Reset\"\n- \"Are you sure you want to reset the game?\\n\\nYour saved progress will be lost and you\\'ll be sent to the start of the game.\"\n\n@mvtenorio, mind helping out with these? :smile:\n Thank you!\n  There are a few new German translations left to do.\n\nIn https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/lang/de/index.html#L25:\n- \"Level\"\n\nIn https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/messages.js:\n- \"Reset\"\n- \"Are you sure you want to reset the game?\\n\\nYour saved progress will be lost and you\\'ll be sent to the start of the game.\"\n\nCan someone help with these? (@tfrommen :wink:)\n Thanks @tfrommen, the way languages are handled is definitely due for a refactor. Your approach looks good to me, though I might prefer to use a query string than automatically detect the user language. I'll merge your changes for now and hopefully get to that soon.\n  Hi @Notuom, this is just super. Not only the French translation but the other improvements. Thanks!\n  Thanks for the suggestion, there was similar discussion also in #14.\n\nI'm making the switch from png to svg. The image load drops from 49kb to 25kb and as for image quality, you can judge for yourself. PNG left, SVG right.\n\n<img width=\"162\" alt=\"screen shot 2015-12-05 at 3 37 01 am\" src=\"https://cloud.githubusercontent.com/assets/900407/11606940/01fae954-9b02-11e5-87b2-9aa2ef20095d.png\"> <img width=\"162\" alt=\"screen shot 2015-12-05 at 3 36 54 am\" src=\"https://cloud.githubusercontent.com/assets/900407/11606941/0553dca0-9b02-11e5-9f68-4bc0a967e43c.png\">\n  Hi @solsend2l, thanks for your comments!\n\nI agree that level 24 is pretty tough, but I intended it to be like that to give the opportunity to play around with all of the properties one last time, and as a \"boss level\" final challenge to add a sense of accomplishment.\n\nI hope you found the previous 23 levels to have a smooth learning curve.\n  Visually it looks great. Fits with the style, and it's visible but subtle.\n\nNot sure how it would work when there's no space, like when a lilypad is on the edge of the pond or there are multiply lilypads lined up.\n\nAlso wondering how to best implement it. Perhaps grab the computed style for each lilypad, then apply a class based on each's flex-direction.\n  Thanks for the fix.\n  Agree, though technically valid to leave off the semicolon for the last rule in a ruleset, it would be good to give the suggestion. Ties into discussion in #15 about a warning/hint system.\n  Great, thanks for this.\n  Looks perfect, thanks! Gonna merge and add a link to PT-BR on the front page.\n  Eventually I'd love to parse the answers and add some tailored, localized hints for common errors (like `row-reversed`). I'm collecting some analytics data on that.\n\nIn the meantime, minor improvements could still be made to the feedback. There's subtle feedback in that the \"Next\" button changes from a disabled to active state. Maybe the color could also be changed from red to green when the level is solved.\n  Hi @ralts00, thanks for the PR. Can you post some before/after screenshots?\n I like some of the changes, but would like to hold off on the stylistic changes for now, because there may be bigger color changes coming to make it more accessible to the colorblind. I do think the tweak to the yellow frog is an improvement.\n Thanks for discussion, guys. Images have been switched to SVG (see #22).\n  Thanks for the bug report. Both answers should result in identical layouts, but the positions seems to be off by a few hundredths of a pixel. Fix on the way.\n  I like the idea of auto applying styles. But I'm wondering what the role of the submit button should be then.\n\nFor example, you type in the correct solution and the frog is on the lilypad. At that point, should the answer be checked automatically (removing the need for a submit button), or require a button click?\n\nIf checked automatically, I could see it rushing the user onto the next level before they get a chance to see and internalize the problem/solution. But it might also feel redundant and pointless to require a button click after the frog is already on the lilypad.\n I like @tommarshall's idea for changing it to the \"next\" button. Gonna get to work on this...\n  Ah, thanks for the fix!\n  Nice catch, thanks!\n  Would love your help in localizing this! I'll look into getting Froggy set up for localization, so you can drop in the translations. If you know any libraries that would help with this, please let me know.\n Hey @manuelitox, Flexbox Froggy is ready for translation! They can be added to the following files by including an `es` property beside the `en` one. I've already added a couple of test cases (using Google Translate).\n- [js/levels.js](https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/levels.js)\n- [js/docs.js](https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/docs.js)\n\nThere are also a few strings that should be translated in [lang/es/index.html](https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/lang/es/index.html) such as \"Level\" and \"Next\".\n\nThe Spanish version will be available at http://flexboxfroggy.com/lang/es/. Look forward to your translations! Once it's ready, I'll add a link to the main page.\n @mvtenorio, would be great to also have a Portuguese translation. Let me know if you have any questions about how to add it to the project.\n\n@manuelitox, awesome!\n Added in c991397bc5169cc263faaddde41976c5744ea964!\n  Thanks for the bug report, fix incoming.\n  This is a great suggestion. Could you make some minor tweaks to PR?\n- Separate this as its own condition. Reason being that ctrl-return should submit no matter what, but if there's any whitespace before or after, it will be trimmed instead.\n- Have it be the first condition, again so it's guaranteed to submit.\n- Also check for `e.metaKey` for Mac.\n :+1: Looks good, thanks for this!\n  I intended for the last level to be like a video game boss fight, so it is meant to be tougher than the others for sure.\n\nBut that doesn't mean I expect people to memorize all of the properties and values. I actually added a few features (which might not all be obvious) to encourage people to flip back and forth to earlier lessons as reference:\n- You can hit the back and prev level buttons\n- Your state is saved whenever you move to a different level\n- You can hover any property name to view a tooltip reference\n  \n  <img width=\"274\" alt=\"screen shot 2015-12-01 at 3 14 55 pm\" src=\"https://cloud.githubusercontent.com/assets/900407/11512860/4d23be9a-983e-11e5-9289-49f331d42ba9.png\">\n- You can click \"Level n of 24\" to jump directly to any level and see their completion state\n  \n  <img width=\"286\" alt=\"screen shot 2015-12-01 at 3 14 06 pm\" src=\"https://cloud.githubusercontent.com/assets/900407/11512868/56f14b72-983e-11e5-9ee9-c7762fe45777.png\">\n\nI only did this at the end so it doesn't break the flow. My hope is the last level gives players a real sense of accomplishment for beating the game.\n That's fair enough. Listing all of the properties in the final level text would definitely reduce frustration, and should keep much of the challenge.\n  Sweet, thanks for the fix!\n  It works like `z-index` in that if the value is greater than the value of the others (in this case, the default 0), it'll be moved to the end of the order. So 1, 2, 3,... are all valid answers.\n No problem!\n  Thanks @chikamichi, great idea. Right now it's not obvious (let alone satisfying) that you've won the game, and you even miss out on the \"fly out\" animation of every other level. Gonna add something shortly.\n Here's a screenshot of the new end screen:\n\n<img width=\"1073\" alt=\"screen shot 2015-11-25 at 4 09 03 pm\" src=\"https://cloud.githubusercontent.com/assets/900407/11409571/e3af7476-938e-11e5-9ad8-83ba1020da74.png\">\n  Thanks for the suggestion. Those properties are pretty tricky, but I'd still like to incorporate them into the game somehow. Same goes for a few values I skipped, like `baseline`, and `stretch`.\n", "text_all_count": 3501, "text_word_token": ["Hey", "pavelbelousov", "appreciate", "the", "fix", "Akirtovskis", "thanks", "for", "the", "speedy", "translations", "to", "the", "new", "settings", "Looks", "like", "an", "unclosed", "code", "tag", "along", "with", "the", "p", "tag", "NUMBER", "I", "ll", "push", "a", "fix", "for", "it", "now", "NUMBER", "LHSnow", "thanks", "for", "the", "bug", "report", "NUMBER", "Fix", "on", "the", "way", "NUMBER", "Hey", "Akirtovskis", "welcome", "to", "the", "open", "source", "world", "and", "thanks", "for", "your", "contribution", "Adding", "a", "comma", "will", "display", "like", "that", "so", "no", "need", "to", "worry", "or", "do", "anything", "different", "NUMBER", "The", "translation", "looks", "good", "but", "there", "be", "a", "few", "spots", "in", "levels", "NUMBER", "js", "where", "you", "add", "a", "line", "return", "in", "the", "middle", "of", "the", "string", "line", "NUMBER", "LINK", "diff", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "beb", "NUMBER", "dc", "NUMBER", "deabR", "NUMBER", "line", "NUMBER", "LINK", "diff", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "beb", "NUMBER", "dc", "NUMBER", "deabR", "NUMBER", "line", "NUMBER", "LINK", "diff", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "d", "NUMBER", "f", "NUMBER", "beb", "NUMBER", "dc", "NUMBER", "deabR", "NUMBER", "Can", "you", "delete", "the", "returns", "so", "all", "the", "text", "be", "on", "a", "single", "line", "You", "make", "make", "a", "new", "commit", "for", "it", "then", "I", "ll", "merge", "in", "your", "work", "NUMBER", "Let", "me", "know", "if", "you", "have", "any", "question", "NUMBER", "Looks", "like", "you", "miss", "one", "at", "line", "NUMBER", "Otherwise", "looks", "ready", "to", "go", "Perfect", "I", "ll", "merge", "this", "in", "now", "NUMBER", "Honored", "to", "have", "our", "project", "be", "your", "first", "PR", "NUMBER", "Nice", "work", "You", "might", "need", "to", "flush", "your", "browser", "cache", "to", "get", "it", "to", "show", "NUMBER", "Hey", "ajrussellaudio", "thanks", "for", "your", "work", "on", "this", "NUMBER", "We", "ve", "gotten", "many", "request", "for", "a", "color", "blind", "mind", "so", "this", "be", "a", "welcome", "and", "overdue", "feature", "NUMBER", "Everything", "looks", "great", "NUMBER", "Just", "one", "small", "tweak", "NUMBER", "The", "real", "estate", "be", "tight", "as", "it", "be", "so", "could", "you", "restyle", "the", "toggle", "color", "blind", "mode", "button", "to", "match", "the", "language", "menu", "and", "place", "it", "inline", "to", "the", "right", "of", "it", "in", "the", "footer", "Looks", "great", "NUMBER", "Let", "s", "merge", "it", "in", "Thanks", "MeenChul", "Looks", "great", "David", "thanks", "for", "the", "translation", "Thanks", "assuming", "this", "will", "fix", "the", "tooltip", "issue", "with", "the", "hard", "mode", "PR", "though", "Hey", "mcshiz", "thanks", "for", "this", "pull", "request", "looks", "good", "and", "I", "love", "the", "idea", "of", "randomizing", "levels", "on", "top", "of", "hiding", "the", "instructions", "NUMBER", "One", "issue", "be", "that", "it", "won", "t", "be", "immediately", "obvious", "what", "the", "different", "levels", "do", "NUMBER", "How", "about", "if", "we", "do", "a", "pop", "up", "like", "for", "languages", "for", "Beginner", "Intermediate", "Advanced", "with", "short", "descriptions", "of", "what", "each", "do", "NUMBER", "Would", "you", "be", "up", "for", "work", "on", "that", "The", "menu", "looks", "great", "just", "what", "I", "was", "hoping", "for", "NUMBER", "I", "notice", "a", "new", "bug", "with", "the", "padding", "of", "the", "properties", "tooltips", "NUMBER", "Aside", "from", "that", "it", "looks", "good", "to", "go", "NUMBER", "TAG", "Merged", "Hey", "joykuotw", "thanks", "for", "refining", "the", "translations", "NUMBER", "Grateful", "for", "your", "efforts", "diabloevagto", "thanks", "for", "the", "translation", "Thanks", "shuuji", "NUMBER", "Thanks", "for", "the", "correction", "not", "NUMBER", "lmintmate", "looks", "great", "thanks", "for", "this", "translation", "NUMBER", "I", "ll", "merge", "it", "in", "now", "kant", "thanks", "for", "the", "fix", "Can", "t", "replicate", "this", "on", "Firefox", "NUMBER", "on", "Mac", "NUMBER", "Could", "you", "try", "disabling", "your", "add", "ons", "and", "see", "if", "it", "s", "still", "a", "problem", "Thanks", "NUMBER", "laurensclaessen", "much", "appreciate", "the", "translation", "Many", "thanks", "for", "the", "tweak", "tuanphpvn", "NUMBER", "BoyWithSilverWings", "thanks", "for", "the", "translation", "glad", "to", "add", "Malayalam", "to", "the", "list", "NUMBER", "Will", "also", "add", "you", "to", "the", "readme", "NUMBER", "Thank", "you", "sir", "NUMBER", "Hey", "Repjarms", "looks", "like", "that", "gap", "shows", "up", "due", "to", "rounding", "error", "NUMBER", "Would", "love", "a", "PR", "on", "this", "LittaPanda", "thanks", "for", "the", "bug", "report", "NUMBER", "Does", "it", "happen", "when", "you", "run", "Froggy", "in", "incognito", "mode", "How", "about", "if", "you", "clear", "browser", "data", "for", "flexboxfroggy", "NUMBER", "com", "Any", "reason", "the", "Parse", "script", "at", "LINK", "NUMBER", "dist", "parse", "NUMBER", "min", "NUMBER", "js", "might", "not", "be", "loading", "Maybe", "a", "browser", "extension", "be", "blocking", "it", "Hoping", "to", "add", "this", "feature", "eventually", "but", "in", "the", "meantime", "Programming", "Mentor", "has", "put", "together", "this", "nice", "guide", "LINK", "css", "grid", "garden", "Hey", "SherylHohman", "thanks", "for", "your", "comments", "NUMBER", "Point", "well", "taken", "about", "level", "NUMBER", "cause", "misconceptions", "about", "how", "order", "works", "NUMBER", "I", "ll", "look", "into", "tweaking", "something", "like", "the", "order", "of", "the", "levels", "or", "add", "a", "clue", "to", "the", "level", "NUMBER", "instructions", "to", "help", "people", "get", "unstuck", "NUMBER", "There", "be", "a", "couple", "of", "things", "that", "help", "with", "this", "right", "now", "though", "NUMBER", "First", "be", "players", "can", "freely", "move", "back", "and", "forth", "between", "levels", "to", "review", "earlier", "info", "NUMBER", "Second", "be", "that", "you", "can", "hover", "underlined", "properties", "to", "get", "similar", "info", "NUMBER", "For", "order", "it", "also", "gives", "you", "example", "values", "TAG", "Your", "suggestion", "in", "NUMBER", "to", "add", "hints", "or", "solutions", "would", "also", "help", "deal", "with", "this", "NUMBER", "Hey", "neotan", "thanks", "for", "the", "refinements", "Hey", "pckltr", "looks", "good", "but", "can", "you", "keep", "the", "languages", "on", "index", "NUMBER", "html", "in", "the", "original", "order", "and", "add", "Romanian", "after", "Magyar", "They", "re", "roughly", "ordered", "by", "geography", "so", "similar", "languages", "can", "be", "grouped", "together", "NUMBER", "Thanks", "leonine", "NUMBER", "thanks", "for", "the", "tweak", "and", "again", "for", "your", "work", "on", "translating", "Grid", "Garden", "LINK", "Hey", "ocelotluke", "thanks", "for", "your", "thoughtful", "suggestions", "NUMBER", "I", "m", "very", "open", "to", "the", "idea", "of", "provide", "supplemental", "materials", "which", "could", "take", "many", "different", "form", "NUMBER", "The", "GitHub", "wiki", "might", "be", "a", "good", "way", "to", "collaborate", "on", "this", "NUMBER", "Pages", "can", "be", "created", "for", "per", "level", "explanations", "as", "well", "as", "a", "cheat", "sheet", "that", "explains", "in", "more", "detail", "the", "different", "properties", "values", "and", "also", "links", "to", "additional", "resources", "NUMBER", "And", "then", "we", "could", "link", "back", "from", "Froggy", "to", "the", "individual", "wiki", "pages", "where", "relevant", "NUMBER", "Downside", "of", "this", "be", "that", "when", "Froggy", "be", "use", "as", "a", "class", "activity", "students", "can", "just", "copy", "paste", "answers", "from", "the", "wiki", "instead", "of", "work", "through", "it", "NUMBER", "Or", "we", "could", "have", "the", "explanations", "more", "deeply", "integrated", "with", "the", "game", "NUMBER", "Make", "full", "explanations", "only", "available", "when", "a", "level", "be", "completed", "NUMBER", "I", "have", "gotten", "note", "from", "people", "that", "they", "use", "Froggy", "as", "an", "interactive", "reference", "NUMBER", "They", "go", "back", "to", "specific", "levels", "and", "experiment", "with", "different", "values", "to", "get", "a", "better", "grasp", "on", "a", "certain", "property", "NUMBER", "Maybe", "if", "the", "levels", "had", "descriptions", "e", "NUMBER", "g", "NUMBER", "hover", "over", "a", "number", "in", "the", "level", "menu", "to", "get", "a", "tooltip", "of", "its", "topic", "it", "could", "help", "this", "use", "case", "NUMBER", "ivandevp", "thanks", "for", "the", "corrections", "NUMBER", "Sure", "you", "can", "hit", "the", "reset", "link", "here", "to", "clear", "everything", "out", "TAG", "Just", "spotted", "this", "miss", "Japanese", "string", "while", "work", "on", "the", "language", "menu", "LINK", "pages", "js", "message", "NUMBER", "js", "L", "NUMBER", "ginpei", "would", "you", "be", "able", "to", "add", "it", "Ah", "thanks", "for", "the", "explanation", "I", "had", "no", "idea", "NUMBER", "We", "can", "leave", "it", "as", "be", "then", "Awesome", "thanks", "gbhasha", "Thanks", "peterver", "looks", "good", "to", "me", "gridgarden", "LINK", "NUMBER", "a", "NUMBER", "d", "NUMBER", "e", "NUMBER", "NUMBER", "NUMBER", "fb", "NUMBER", "a", "NUMBER", "d", "NUMBER", "png", "Just", "put", "the", "finishing", "touches", "on", "Grid", "Garden", "LINK", "LINK", "Loved", "the", "Grid", "Giraffe", "idea", "but", "sadly", "couldn", "t", "get", "it", "to", "work", "NUMBER", "Turns", "out", "a", "carrot", "be", "much", "easier", "to", "draw", "than", "a", "giraffe", "Hey", "Danko", "thanks", "for", "this", "I", "ll", "do", "a", "more", "thorough", "review", "soon", "but", "can", "you", "make", "one", "quick", "change", "Change", "the", "language", "key", "from", "ser", "to", "sr", "which", "be", "the", "official", "ISO", "code", "LINK", "_of_ISO_", "NUMBER", "NUMBER", "_codes", "for", "Serbian", "NUMBER", "Thanks", "just", "one", "more", "thing", "I", "spotted", "NUMBER", "You", "miss", "the", "translation", "at", "the", "end", "of", "levels", "NUMBER", "js", "LINK", "L", "NUMBER", "Otherwise", "looks", "good", "to", "go", "Merged", "Danko", "much", "thanks", "for", "your", "contribution", "NUMBER", "Hey", "Shubham", "thanks", "for", "this", "really", "glad", "to", "finally", "have", "a", "Hindi", "translation", "KochetkovEgor", "thanks", "for", "the", "fix", "Thanks", "mihailgaberov", "NUMBER", "Thanks", "Christian", "mihailgaberov", "thanks", "for", "contribute", "this", "translation", "Hey", "coliff", "thanks", "for", "this", "NUMBER", "Hey", "theJollySin", "feel", "free", "to", "use", "the", "the", "images", "NUMBER", "I", "m", "add", "a", "note", "in", "the", "README", "that", "they", "be", "release", "under", "Creative", "Commons", "CC", "BY", "NUMBER", "license", "which", "only", "requires", "attribution", "NUMBER", "Hey", "shadoll", "this", "be", "looking", "great", "NUMBER", "Can", "you", "just", "switch", "the", "lang", "code", "to", "uk", "While", "ua", "be", "use", "for", "country", "uk", "be", "use", "for", "the", "language", "LINK", "_of_ISO_", "NUMBER", "NUMBER", "_codes", "NUMBER", "Thanks", "I", "would", "definitely", "be", "open", "to", "something", "this", "NUMBER", "Maybe", "an", "alternate", "color", "palette", "or", "giving", "the", "frogs", "different", "patterns", "NUMBER", "Other", "ideas", "Thanks", "Daniel", "for", "the", "pull", "request", "I", "m", "sure", "the", "examples", "will", "be", "a", "big", "help", "to", "some", "of", "the", "new", "coders", "out", "there", "Thanks", "for", "the", "suggestion", "I", "d", "be", "open", "to", "a", "PR", "for", "this", "NUMBER", "Maybe", "something", "as", "simple", "as", "a", "parenthetical", "with", "example", "numbers", "would", "be", "enough", "NUMBER", "This", "would", "be", "easy", "to", "add", "to", "all", "translations", "as", "well", "NUMBER", "Something", "like", "NUMBER", "we", "can", "use", "this", "property", "to", "set", "it", "to", "a", "positive", "or", "negative", "integer", "value", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "zbtn", "thanks", "for", "the", "corrections", "Thanks", "Hey", "Martin", "thanks", "for", "the", "translation", "NUMBER", "Much", "appreciated", "Thanks", "Harvey", "NUMBER", "Looks", "great", "Works", "ok", "for", "me", "on", "Firefox", "NUMBER", "Are", "you", "seeing", "any", "error", "in", "console", "Hey", "sunsheeppoplar", "thanks", "for", "this", "translation", "NUMBER", "Looks", "good", "to", "me", "NUMBER", "Hi", "dm", "wyncode", "the", "Hungarian", "translation", "was", "recently", "add", "NUMBER", "A", "bug", "be", "cause", "the", "new", "Hungarian", "instructions", "to", "overwrite", "English", "for", "levels", "NUMBER", "and", "NUMBER", "Thanks", "for", "your", "detailed", "report", "I", "was", "able", "to", "track", "it", "down", "and", "will", "push", "a", "fix", "shortly", "NUMBER", "Hi", "Adam", "thanks", "so", "much", "for", "your", "translation", "NUMBER", "It", "looks", "ready", "to", "go", "rankill", "thanks", "for", "the", "typo", "fix", "But", "looks", "like", "you", "commit", "some", "unrelated", "change", "since", "then", "NUMBER", "Ok", "will", "close", "this", "issue", "NUMBER", "Cheers", "NUMBER", "ginpei", "thanks", "so", "much", "for", "this", "translation", "I", "ll", "go", "ahead", "and", "merge", "this", "NUMBER", "Agree", "that", "CJK", "should", "be", "clustered", "together", "but", "I", "can", "take", "care", "of", "this", "myself", "NUMBER", "Hey", "liberaliscomputing", "I", "left", "a", "few", "comments", "on", "your", "PR", "NUMBER", "Thanks", "NUMBER", "Thanks", "for", "the", "tweak", "NUMBER", "Thanks", "for", "the", "fix", "Thanks", "MightyPork", "thanks", "for", "the", "translation", "NUMBER", "Could", "you", "squash", "all", "of", "your", "change", "into", "one", "single", "commit", "for", "the", "pull", "request", "kingstenbanh", "thank", "you", "eLGi", "thanks", "for", "the", "translation", "Thanks", "this", "be", "great", "NUMBER", "But", "can", "you", "keep", "the", "PR", "to", "just", "the", "translation", "Instead", "of", "add", "gitignore", "to", "this", "project", "I", "recommend", "setting", "up", "a", "global", "gitignore", "LINK", "file", "create", "a", "global", "gitignore", "NUMBER", "Merged", "in", "NUMBER", "You", "should", "be", "able", "to", "just", "hit", "enter", "to", "submit", "your", "answer", "but", "make", "it", "more", "semantic", "and", "accessible", "doesn", "t", "hurt", "NUMBER", "Pushing", "a", "change", "for", "this", "now", "NUMBER", "Thanks", "for", "the", "suggestion", "NUMBER", "Thanks", "for", "the", "fix", "Awesome", "thanks", "justutiz", "Meen", "Chul", "this", "be", "great", "NUMBER", "Thanks", "for", "your", "help", "NUMBER", "Grazie", "Much", "appreciated", "Thanks", "for", "this", "NUMBER", "Many", "thanks", "for", "this", "timguoqk", "timguoqk", "just", "spotted", "that", "a", "translation", "for", "Level", "be", "miss", "here", "LINK", "pages", "js", "message", "NUMBER", "js", "L", "NUMBER", "Can", "you", "provide", "one", "Ah", "thanks", "for", "the", "clarification", "NUMBER", "alihaddadkar", "this", "be", "awesome", "thanks", "for", "it", "NUMBER", "Thanks", "Wonderful", "NUMBER", "smile", "Thanks", "for", "the", "translation", "artem", "NUMBER", "How", "do", "something", "like", "NUMBER", "sound", "Repeating", "the", "levels", "with", "the", "instructions", "toggled", "off", "NUMBER", "I", "was", "also", "thinking", "about", "a", "mode", "that", "generates", "levels", "with", "a", "random", "combination", "of", "properties", "NUMBER", "Thanks", "the", "whole", "thing", "be", "due", "for", "a", "refactor", "see", "NUMBER", "but", "this", "be", "nice", "improvement", "in", "the", "meantime", "NUMBER", "Hi", "alihaddadkar", "thanks", "for", "this", "NUMBER", "A", "few", "comments", "Changes", "to", "the", "CSS", "should", "be", "minimized", "NUMBER", "For", "example", "if", "the", "Farsi", "displays", "ok", "without", "add", "the", "custom", "font", "it", "should", "be", "remove", "NUMBER", "Likewise", "there", "shouldn", "t", "be", "any", "change", "to", "the", "HTML", "NUMBER", "Chances", "be", "we", "ll", "be", "moving", "to", "a", "single", "HTML", "doc", "soon", "so", "they", "ll", "get", "wiped", "anyway", "NUMBER", "I", "do", "plan", "to", "add", "a", "README", "that", "will", "credit", "all", "of", "the", "translators", "contributions", "NUMBER", "To", "support", "interface", "change", "for", "RTL", "e", "NUMBER", "g", "NUMBER", "setting", "direction", "rtl", "reversing", "the", "previous", "next", "buttons", "perhaps", "we", "can", "set", "a", "rtl", "class", "to", "body", "use", "JS", "and", "add", "styles", "use", "that", "NUMBER", "There", "s", "also", "a", "bigger", "question", "about", "change", "to", "the", "levels", "themselves", "NUMBER", "RTL", "means", "the", "horizontal", "axis", "of", "flexbox", "be", "also", "flipped", "NUMBER", "Allowing", "that", "to", "happen", "means", "the", "word", "of", "the", "instructions", "may", "also", "need", "to", "be", "change", "NUMBER", "To", "use", "Tahoma", "you", "could", "try", "something", "like", "html", "lang", "fa", "font", "family", "Tahoma", "Geneva", "Verdana", "sans", "serif", "How", "about", "applying", "RTL", "like", "this", "instructions", "credits", "direction", "rtl", "By", "the", "way", "the", "language", "stuff", "has", "be", "reworked", "NUMBER", "There", "s", "just", "a", "single", "index", "NUMBER", "html", "file", "now", "and", "all", "the", "translations", "can", "be", "made", "in", "the", "JS", "file", "NUMBER", "This", "be", "fantastic", "NUMBER", "Thanks", "manuelitox", "for", "improving", "the", "Google", "Translate", "version", "as", "well", "NUMBER", "smile", "I", "ll", "be", "sure", "to", "tag", "you", "if", "any", "translations", "be", "need", "in", "the", "future", "NUMBER", "Thanks", "for", "the", "tweak", "There", "be", "a", "few", "new", "Portuguese", "translations", "left", "to", "do", "NUMBER", "In", "LINK", "pages", "js", "message", "NUMBER", "js", "Reset", "Are", "you", "sure", "you", "want", "to", "reset", "the", "game", "n", "nYour", "saved", "progress", "will", "be", "lost", "and", "you", "ll", "be", "sent", "to", "the", "start", "of", "the", "game", "NUMBER", "mvtenorio", "mind", "helping", "out", "with", "these", "smile", "Thank", "you", "There", "be", "a", "few", "new", "German", "translations", "left", "to", "do", "NUMBER", "In", "LINK", "pages", "lang", "de", "index", "NUMBER", "html", "L", "NUMBER", "Level", "In", "LINK", "pages", "js", "message", "NUMBER", "js", "Reset", "Are", "you", "sure", "you", "want", "to", "reset", "the", "game", "n", "nYour", "saved", "progress", "will", "be", "lost", "and", "you", "ll", "be", "sent", "to", "the", "start", "of", "the", "game", "NUMBER", "Can", "someone", "help", "with", "these", "tfrommen", "wink", "Thanks", "tfrommen", "the", "way", "languages", "be", "handle", "be", "definitely", "due", "for", "a", "refactor", "NUMBER", "Your", "approach", "looks", "good", "to", "me", "though", "I", "might", "prefer", "to", "use", "a", "query", "string", "than", "automatically", "detect", "the", "user", "language", "NUMBER", "I", "ll", "merge", "your", "change", "for", "now", "and", "hopefully", "get", "to", "that", "soon", "NUMBER", "Hi", "Notuom", "this", "be", "just", "super", "NUMBER", "Not", "only", "the", "French", "translation", "but", "the", "other", "improvement", "NUMBER", "Thanks", "Thanks", "for", "the", "suggestion", "there", "was", "similar", "discussion", "also", "in", "NUMBER", "I", "m", "make", "the", "switch", "from", "png", "to", "svg", "NUMBER", "The", "image", "load", "drops", "from", "NUMBER", "kb", "to", "NUMBER", "kb", "and", "as", "for", "image", "quality", "you", "can", "judge", "for", "yourself", "NUMBER", "PNG", "left", "SVG", "right", "NUMBER", "TAG", "TAG", "Hi", "solsend", "NUMBER", "l", "thanks", "for", "your", "comments", "I", "agree", "that", "level", "NUMBER", "be", "pretty", "tough", "but", "I", "intended", "it", "to", "be", "like", "that", "to", "give", "the", "opportunity", "to", "play", "around", "with", "all", "of", "the", "properties", "one", "last", "time", "and", "as", "a", "boss", "level", "final", "challenge", "to", "add", "a", "sense", "of", "accomplishment", "NUMBER", "I", "hope", "you", "find", "the", "previous", "NUMBER", "levels", "to", "have", "a", "smooth", "learning", "curve", "NUMBER", "Visually", "it", "looks", "great", "NUMBER", "Fits", "with", "the", "style", "and", "it", "s", "visible", "but", "subtle", "NUMBER", "Not", "sure", "how", "it", "would", "work", "when", "there", "s", "no", "space", "like", "when", "a", "lilypad", "be", "on", "the", "edge", "of", "the", "pond", "or", "there", "be", "multiply", "lilypads", "lined", "up", "NUMBER", "Also", "wondering", "how", "to", "best", "implement", "it", "NUMBER", "Perhaps", "grab", "the", "computed", "style", "for", "each", "lilypad", "then", "apply", "a", "class", "based", "on", "each", "s", "flex", "direction", "NUMBER", "Thanks", "for", "the", "fix", "NUMBER", "Agree", "though", "technically", "valid", "to", "leave", "off", "the", "semicolon", "for", "the", "last", "rule", "in", "a", "ruleset", "it", "would", "be", "good", "to", "give", "the", "suggestion", "NUMBER", "Ties", "into", "discussion", "in", "NUMBER", "about", "a", "warning", "hint", "system", "NUMBER", "Great", "thanks", "for", "this", "NUMBER", "Looks", "perfect", "thanks", "Gonna", "merge", "and", "add", "a", "link", "to", "PT", "BR", "on", "the", "front", "page", "NUMBER", "Eventually", "I", "d", "love", "to", "parse", "the", "answers", "and", "add", "some", "tailored", "localized", "hints", "for", "common", "error", "like", "row", "reversed", "NUMBER", "I", "m", "collecting", "some", "analytics", "data", "on", "that", "NUMBER", "In", "the", "meantime", "minor", "improvement", "could", "still", "be", "made", "to", "the", "feedback", "NUMBER", "There", "s", "subtle", "feedback", "in", "that", "the", "Next", "button", "change", "from", "a", "disabled", "to", "active", "state", "NUMBER", "Maybe", "the", "color", "could", "also", "be", "change", "from", "red", "to", "green", "when", "the", "level", "be", "solve", "NUMBER", "Hi", "ralts", "NUMBER", "thanks", "for", "the", "PR", "NUMBER", "Can", "you", "post", "some", "before", "after", "screenshots", "I", "like", "some", "of", "the", "change", "but", "would", "like", "to", "hold", "off", "on", "the", "stylistic", "change", "for", "now", "because", "there", "may", "be", "bigger", "color", "change", "come", "to", "make", "it", "more", "accessible", "to", "the", "colorblind", "NUMBER", "I", "do", "think", "the", "tweak", "to", "the", "yellow", "frog", "be", "an", "improvement", "NUMBER", "Thanks", "for", "discussion", "guys", "NUMBER", "Images", "have", "be", "switched", "to", "SVG", "see", "NUMBER", "NUMBER", "Thanks", "for", "the", "bug", "report", "NUMBER", "Both", "answers", "should", "result", "in", "identical", "layouts", "but", "the", "positions", "seems", "to", "be", "off", "by", "a", "few", "hundredths", "of", "a", "pixel", "NUMBER", "Fix", "on", "the", "way", "NUMBER", "I", "like", "the", "idea", "of", "auto", "applying", "styles", "NUMBER", "But", "I", "m", "wondering", "what", "the", "role", "of", "the", "submit", "button", "should", "be", "then", "NUMBER", "For", "example", "you", "type", "in", "the", "correct", "solution", "and", "the", "frog", "be", "on", "the", "lilypad", "NUMBER", "At", "that", "point", "should", "the", "answer", "be", "checked", "automatically", "remove", "the", "need", "for", "a", "submit", "button", "or", "require", "a", "button", "click", "If", "checked", "automatically", "I", "could", "see", "it", "rushing", "the", "user", "onto", "the", "next", "level", "before", "they", "get", "a", "chance", "to", "see", "and", "internalize", "the", "problem", "solution", "NUMBER", "But", "it", "might", "also", "feel", "redundant", "and", "pointless", "to", "require", "a", "button", "click", "after", "the", "frog", "be", "already", "on", "the", "lilypad", "NUMBER", "I", "like", "tommarshall", "s", "idea", "for", "change", "it", "to", "the", "next", "button", "NUMBER", "Gonna", "get", "to", "work", "on", "this", "NUMBER", "Ah", "thanks", "for", "the", "fix", "Nice", "catch", "thanks", "Would", "love", "your", "help", "in", "localizing", "this", "I", "ll", "look", "into", "get", "Froggy", "set", "up", "for", "localization", "so", "you", "can", "drop", "in", "the", "translations", "NUMBER", "If", "you", "know", "any", "libraries", "that", "would", "help", "with", "this", "please", "let", "me", "know", "NUMBER", "Hey", "manuelitox", "Flexbox", "Froggy", "be", "ready", "for", "translation", "They", "can", "be", "add", "to", "the", "following", "file", "by", "including", "an", "es", "property", "beside", "the", "en", "one", "NUMBER", "I", "ve", "already", "add", "a", "couple", "of", "test", "cases", "use", "Google", "Translate", "NUMBER", "js", "levels", "NUMBER", "js", "LINK", "pages", "js", "levels", "NUMBER", "js", "js", "docs", "NUMBER", "js", "LINK", "pages", "js", "docs", "NUMBER", "js", "There", "be", "also", "a", "few", "strings", "that", "should", "be", "translated", "in", "lang", "es", "index", "NUMBER", "html", "LINK", "pages", "lang", "es", "index", "NUMBER", "html", "such", "as", "Level", "and", "Next", "NUMBER", "The", "Spanish", "version", "will", "be", "available", "at", "LINK", "Look", "forward", "to", "your", "translations", "Once", "it", "s", "ready", "I", "ll", "add", "a", "link", "to", "the", "main", "page", "NUMBER", "mvtenorio", "would", "be", "great", "to", "also", "have", "a", "Portuguese", "translation", "NUMBER", "Let", "me", "know", "if", "you", "have", "any", "question", "about", "how", "to", "add", "it", "to", "the", "project", "NUMBER", "manuelitox", "awesome", "Added", "in", "c", "NUMBER", "bc", "NUMBER", "cc", "NUMBER", "faaddde", "NUMBER", "c", "NUMBER", "ea", "NUMBER", "Thanks", "for", "the", "bug", "report", "fix", "incoming", "NUMBER", "This", "be", "a", "great", "suggestion", "NUMBER", "Could", "you", "make", "some", "minor", "tweak", "to", "PR", "Separate", "this", "as", "its", "own", "condition", "NUMBER", "Reason", "be", "that", "ctrl", "return", "should", "submit", "no", "matter", "what", "but", "if", "there", "s", "any", "whitespace", "before", "or", "after", "it", "will", "be", "trimmed", "instead", "NUMBER", "Have", "it", "be", "the", "first", "condition", "again", "so", "it", "s", "guaranteed", "to", "submit", "NUMBER", "Also", "check", "for", "e", "NUMBER", "metaKey", "for", "Mac", "NUMBER", "NUMBER", "Looks", "good", "thanks", "for", "this", "I", "intended", "for", "the", "last", "level", "to", "be", "like", "a", "video", "game", "boss", "fight", "so", "it", "be", "meant", "to", "be", "tougher", "than", "the", "others", "for", "sure", "NUMBER", "But", "that", "doesn", "t", "mean", "I", "expect", "people", "to", "memorize", "all", "of", "the", "properties", "and", "values", "NUMBER", "I", "actually", "add", "a", "few", "features", "which", "might", "not", "all", "be", "obvious", "to", "encourage", "people", "to", "flip", "back", "and", "forth", "to", "earlier", "lessons", "as", "reference", "You", "can", "hit", "the", "back", "and", "prev", "level", "buttons", "Your", "state", "be", "saved", "whenever", "you", "move", "to", "a", "different", "level", "You", "can", "hover", "any", "property", "name", "to", "view", "a", "tooltip", "reference", "TAG", "You", "can", "click", "Level", "n", "of", "NUMBER", "to", "jump", "directly", "to", "any", "level", "and", "see", "their", "completion", "state", "TAG", "I", "only", "did", "this", "at", "the", "end", "so", "it", "doesn", "t", "break", "the", "flow", "NUMBER", "My", "hope", "be", "the", "last", "level", "gives", "players", "a", "real", "sense", "of", "accomplishment", "for", "beating", "the", "game", "NUMBER", "That", "s", "fair", "enough", "NUMBER", "Listing", "all", "of", "the", "properties", "in", "the", "final", "level", "text", "would", "definitely", "reduce", "frustration", "and", "should", "keep", "much", "of", "the", "challenge", "NUMBER", "Sweet", "thanks", "for", "the", "fix", "It", "works", "like", "z", "index", "in", "that", "if", "the", "value", "be", "greater", "than", "the", "value", "of", "the", "others", "in", "this", "case", "the", "default", "NUMBER", "it", "ll", "be", "moved", "to", "the", "end", "of", "the", "order", "NUMBER", "So", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "be", "all", "valid", "answers", "NUMBER", "No", "problem", "Thanks", "chikamichi", "great", "idea", "NUMBER", "Right", "now", "it", "s", "not", "obvious", "let", "alone", "satisfying", "that", "you", "ve", "won", "the", "game", "and", "you", "even", "miss", "out", "on", "the", "fly", "out", "animation", "of", "every", "other", "level", "NUMBER", "Gonna", "add", "something", "shortly", "NUMBER", "Here", "s", "a", "screenshot", "of", "the", "new", "end", "screen", "TAG", "Thanks", "for", "the", "suggestion", "NUMBER", "Those", "properties", "be", "pretty", "tricky", "but", "I", "d", "still", "like", "to", "incorporate", "them", "into", "the", "game", "somehow", "NUMBER", "Same", "goes", "for", "a", "few", "values", "I", "skipped", "like", "baseline", "and", "stretch", "NUMBER"], "text_count": [0, 1471, 298, 136, 52, 7, 114, 0, 7, 162, 274, 449, 201, 156, 138, 24, 0, 0, 0, 0, 491, 138, 77, 34, 63, 86, 0, 0, 0, 0, 906, 587, 333, 7, 217, 51, 0, 0, 0, 0, 1275, 7, 569, 508, 366, 0, 0, 0, 0, 0, 250, 104, 99, 64, 91, 53, 61, 0, 0, 0, 732, 121, 522, 35, 0, 0, 0, 0, 0, 0, 548, 79, 357, 125, 75, 0, 0, 0, 0, 0, 1133, 602, 83, 387, 88, 18, 0, 0, 0, 0, 50, 330, 37, 0, 0, 0, 0, 0, 0, 0, 854, 156, 562, 140, 0, 0, 0, 0, 0, 0, 1276, 2801, 43, 116, 36, 87, 0, 0, 0, 0, 4195, 25, 3273, 46, 818, 806]}, {"repo": "flexboxfroggy", "type": "nonelite", "title": "", "number of text": 196, "text": "    Saw the settings update and decided to add Latvian translation right away. While playing through to recheck my previous translation, found that some more errors and fixed them as well. Enjoy! Though the settings translation works perfectly, there is still some problem with level number 10 in Latvian version. I thought that adding the missing paragraph tag would fix it, but apparently it doesn't. From what I can see it looks equally formatted to other translations that work just as expected.  In docs.js line 165. \r\n\r\nStops execution of js and seems to break hover tooltips.  Added Latvian translations. \r\n\r\nDeletions that show up in files are simply added commas after Macedonian translations. I re-did this twice, thinking that it may have been something on my end, only to realize that everything seems to work fine, just difference looks weird. If anyone has suggestions how to avoid this here or in future, let me know.\r\n\r\nThis is my first contribution to open source and I picked this project because it really helped me to improve my knowledge and application of CSS flexbox. \r\n Thanks, though right now it still shows english version when I choose Latvian on the site! Yes, that was the case! Thanks!   This PR adds a color blind friendly mode. Dark shapes are added to the frogs' bellies and corresponding lily pads, so that frogs can be matched by the shape, rather than by the color.\r\n\r\n<img width=\"392\" alt=\"Frogs with shapes on their bellies, and matching lily pads\" src=\"https://user-images.githubusercontent.com/1347511/38900612-d2e33d74-4293-11e8-8127-1fdb25d75154.png\">\r\n\r\nA button is added below the code entry box to toggle the mode on or off. The setting is stored in localStorage.\r\n\r\nThis is achieved by loading in different SVG files for the frog div backgrounds. Since we're loading SVG images as a background, I didn't see any clean way of dynamically adding the new shapes to the SVG.\r\n\r\nThis has been tested by a student of mine with red-green colorblindness, and gets his thumbs up. If you want to try it for yourself, https://ajrussellaudio.github.io/flexboxfroggy/\r\n\r\nResolves #81  Yeah, maybe I did overstate it a little, thanks for the feedback!  Deprecate 1) importing the Parse library in `index.html` and 2) corresponding code in `js/game.js`  Add Macedonian language translations.  Created a separate pull request as I don't think it was related to the easy/hard mode PR You will have to merge both PR's for it to fix the hardmode. i.e merge in\nthis first then the hardmode.\n\n\nOn Tue, Feb 6, 2018 at 4:29 PM Thomas Park <notifications@github.com> wrote:\n\n> Merged #130 <https://github.com/thomaspark/flexboxfroggy/pull/130>.\n>\n> —\n> You are receiving this because you authored the thread.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/thomaspark/flexboxfroggy/pull/130#event-1461364172>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/AGgR6ql0NvZreiWW5oeOcDtDlClH_Cc3ks5tSO5xgaJpZM4R77n4>\n> .\n>\n  When in hard mode hide instructions and go to random level, medium just hide instructions, easy normal Sure thing. Glad you like it\nOn Mon, Jan 29, 2018 at 2:14 PM Thomas Park <notifications@github.com>\nwrote:\n\n> Hey @mcshiz <https://github.com/mcshiz>, thanks for this pull request,\n> looks good and I love the idea of randomizing levels on top of hiding the\n> instructions.\n>\n> One issue is that it won't be immediately obvious what the different\n> levels do. How about if we do a pop-up (like for languages) for\n> Beginner/Intermediate/Advanced with short descriptions of what each does.\n> Would you be up for working on that?\n>\n> —\n> You are receiving this because you were mentioned.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/thomaspark/flexboxfroggy/pull/129#issuecomment-361405231>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/AGgR6qpdYC-LTu8dGtTH1V4J4xX6ww09ks5tPkKvgaJpZM4Rsazg>\n> .\n>\n Ok, I added some directions to a tooltip like the languages Any updates on this?\r\n  - Fix some typos, missing parts and translation mistakes\r\n- Update the instruction text on winner page to be up to date\r\n\r\nPS. I am native Mandarin speaker.    Same as https://github.com/thomaspark/gridgarden/pull/61  🥕   fix typo\r\n親哇  => 青蛙  I finished the Greek translation for Flexbox Froggy. Please let me know in case there is anything that needs fixing.    ![image](https://user-images.githubusercontent.com/19245567/32102458-0b253764-bb3a-11e7-849f-ffc50940a50a.png)\r\n\r\n yeah, I figured it out. They were due to the addons. welcome\n\nOn Wed, Jan 24, 2018 at 8:19 PM, Thomas Park <notifications@github.com>\nwrote:\n\n> Thanks.\n>\n> —\n> You are receiving this because you authored the thread.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/thomaspark/flexboxfroggy/issues/118#issuecomment-360158462>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/ASWp_0LVq_H5tW2sbsXeJuYB_igbYyk5ks5tN0LfgaJpZM4QI7zr>\n> .\n>\n      Loved your tutorial. \r\nMy mother tongue **Malayalam** was missing from the language list. I have added translations for the aforementioned language.   Fixes #112 \r\n\r\n@thomaspark here is a quick PR to fill the container height of the `line-numbers` class.  When looking at the container for code, there seems to be a hairline gap at the bottom of the code lines. Adding `height: 100%` to the `.line-numbers` class seems to fix this.\r\n\r\nI wanted to post this here in the event that it was helpful. Happy to make a PR if desired.\r\n\r\nWithout `height: 100%`:\r\n![image](https://user-images.githubusercontent.com/4694018/28731555-64183888-73a2-11e7-9526-6f86cea5bd6e.png)\r\n\r\nWith `height: 100%`:\r\n![image](https://user-images.githubusercontent.com/4694018/28731581-7ef6a82e-73a2-11e7-98f9-28903e812f6f.png)\r\n  There is an error when loading page.\r\nSeems to be happening only on Chrome and recently (about a week ago).\r\n```\r\nUncaught ReferenceError: Parse is not defined\r\n    at game.js:1\r\n```\r\n```\r\nParse.initialize(\"FwVMmzHookZZ5j9F9ILc2E5MT5ufabuV7hCXKSeu\");\r\n```\r\nBrowser: Chrome Version 60.0.3112.78 (Official Build) (64-bit)\r\nOS: macOs Sierra 10.12.4 It happens even if I try a hard reload from dev mode.  My bad. In incognito mode it does work.\r\nI've tried clearing the entire cache of my browser, I've also manually cleared the cache data and local storage data for the page, but it still happens.\r\nWhat could be happening here?\r\nCheers. You are totally right.\r\nStands app was blocking https://unpkg.com site.\r\nThanks a lot for your support.\r\nRegards.  Would be nice to provide a solution/explanation for anyone who simply cannot figure one out ;-)\r\n  Level 15, \r\nI expected `order: 1;` (or `order: 0;`) to move the red frog to the first lilypad.\r\n\r\nTo be sure, `order: 5; ` does put the red frog on the 5th lilypad (ie, nothing is reversed).\r\nHowever _any other value_ for order, keeps the red frog on the 4th (starting) lilypad!\r\nI cannot get it to move to 1st, 2nd, or 3rd lilypad with `order: 1;`, `order: 2;`, or `order:3;` or `order:0;`.\r\n\r\nAll other levels work fine for me (though level 24 vexed me with `wrap-reverse`).   \r\n\r\nAm I just missing something obvious ?\r\nI'm using chrome, on win 7, in full screen. I see now that I misunderstood how `order` works.  The first `order` exercise gave me a false impression that I understood how it worked, as `order: 3` was correct.  Being forced to move the frog to the first position on the first exercise would have be more beneficial, IMHO.  There would be no ambiguity of a wrong answer appearing correct, and being accepted as correct.  \r\n\r\nAdditionally, the instructions on the previous page clearly point out that \"all items have a default order of '0'\", so trying `-1` would have been a natural choice.  By the time I got to this exercise, I no longer had this clue, **and** I had false idea of how it worked.\r\n\r\n> ..starting from the lowest numbered ordinal group and going up.  \r\n  Items with the same ordinal group are laid out in the order they appear in the source document.\r\n\r\nat https://tympanus.net/codrops/css_reference/flexbox/#section_order clarified this for me.\r\n\r\nAlso, swapping the order of the two `order` exercises might have be helpful.    Add romanian language and reordered language menu. Done. :)  I realized Persian translation had some typo errors so I've fixed it. You're welcome. I'd be glad to help even a little bit  I just completed the game and it is very informative. I like how the challenges get progressively more difficult, while maintaining the option for help with the hovers, you really did a good job of it! \r\n\r\nThe thing with learning something new is that there is no way of remembering this stuff without repetition & at the end of the game, the user is told that they have done well and are sent on their way, my first feature request would be a cheat-sheet that they can download, to help them remember what they have learned. \r\n\r\nIt would be good if the contributors could make one that is frog themed. Or, with the authors permissions, we could add links to an existing cheat-sheet such as one of the following: \r\n\r\n - https://css-tricks.com/snippets/css/a-guide-to-flexbox/\r\n - http://jonibologna.com/flexbox-cheatsheet/\r\n - http://yoksel.github.io/flex-cheatsheet/\r\n\r\nSecondly, even if the user gets the correct answer they may not understand the logic, that is why websites such as Code Academy and Udacity have answer text / videos respectively, to explain the logic behind the answer. \r\n\r\nMaybe you could have an explanation of the answer shown once the user has answered correctly, just to walk them though the logic. \r\n\r\nI realise that I have touched on a lot of points here & I would quite happily be a contributor to your project, I'm just putting my thoughts on the table. \r\n  Change `estirán` by `estiran`   Is there a way to play this game more than once? Reloading and clearing out the storage doesn't seem to make a difference. Every level is always already completed. Oh cool. I totally missed that! Haha\r\n\r\nThanks  I could translate but left it in English because the phrase is usually written in English in Japanese culture. I'm sure that most Japanese understand it and feel comfortable.\r\n\r\nBut do you want me to add a comment there to make it clear?   Added Tamil Language Translations Hey @gbhasha, thanks for the Tamil translation. Couple things:\r\n\r\n* `docs.js`, which contains the property definitions, also needs to be translated.\r\n* In readme, the Tamil line should be put alphabetically with the other languages.\r\n\r\nOnce these changes are made, I'll merge it in! Added Tamil Translation.    Learning (and recalling) flexbox layout properties with Flexbox Froggy is fun!\r\n\r\nNow grid layout is here!\r\nhttp://caniuse.com/#search=grid\r\nhttps://css-tricks.com/snippets/css/complete-guide-grid/\r\n\r\nAnd it is already can be used with `@supports (display: grid) {}`\r\n\r\nIt would be great to adapt **Froggy** to the new css layout module or make a new project, e.g. **Grid Giraffe** with variable neck sizes! Wow, just wow, great work!\nThe garden theme is suited even more )\nThanks!\n\nOn Apr 6, 2017 03:23, \"Thomas Park\" <notifications@github.com> wrote:\n\n> [image: gridgarden]\n> <https://cloud.githubusercontent.com/assets/900407/24732242/b0689f02-1a3d-11e7-8168-8fb4a4d48951.png>\n>\n> Just put the finishing touches on Grid Garden:\n>\n> http://cssgridgarden.com/\n> https://github.com/thomaspark/gridgarden\n>\n> Loved the Grid Giraffe idea but sadly couldn't get it to work. 😛\n>\n> —\n> You are receiving this because you authored the thread.\n> Reply to this email directly, view it on GitHub\n> <https://github.com/thomaspark/flexboxfroggy/issues/97#issuecomment-292034409>,\n> or mute the thread\n> <https://github.com/notifications/unsubscribe-auth/AC75wwFeifISKarg3ANQe1IMrnKG44EUks5rtDB8gaJpZM4MMKAL>\n> .\n>\n  Hi Thomas, \r\n\r\nI liked your Flexbox Froggy so much that I decided to translate it to my native language - Serbian. \r\n\r\nThank you for your hard work and awesome idea.\r\n\r\nBest,\r\nDanko  Hey Thomas, it's done! If you need me to make more adjustments, I will be happy to do it. Good catch! Since I have been translating from English, maybe a word \"hoppy\" also need correction: \r\nhttps://github.com/dankoknad/flexboxfroggy/blob/gh-pages/js/levels.js#L759 ? Awesome! It was my pleasure, Thomas.  Hey Thomas,\r\nThe Flexboxfroggy game is really cool game, I learnt a lot. I thought I'd add a Hindi translation to it.\r\n\r\n-Shubham  extra syllable in a word \"запутать\"   Welcome :)      This is the recommended way now, and the default Google provide.  The MIT license present in this repo only mentions software and documentation.  What about the images?  If I stole them for some other project, would that be okay?  A small parenthetical phrase would suffice: \"...to any person obtaining a copy of this software, included media files, and associated documentation files...\".    Can you make a color-blind / color-deficient mode? It's extremely difficult for some people to see the difference between the red and green frogs and lilly pads. \n\nThanks for considering! Excellent learning resources.\n Just change the green frog and target pad to blue. [Like this.](https://imgur.com/a/3tqMC?)   That will fix the most common color-blindness (red-green)  Then you can keep adding incremental schemes for the other forms.\r\n\r\nLooks like you could add a checkbox, add the CSS for the new assets, then swap your `color` object if it is selected to `g=blue`\r\n\r\nI'm a newb and only have free web tools, but I'll throw together what I would know how to do so you can see what direction I would come from. Just a suggestion:\r\nTo write a number in the on the frogs stomach and on the corresponding leaf if not the change of color.  Hi there,\n\nAs promised a PR. I thought that simply giving an example for an integer value might clear it up for people new to the industry. I checked every translation for visual bugs, and I am not sure if the farsi one makes sense, this whole right to left thing confuses me, maybe @alihaddadkar may have a look at it.\n\nHave a nice day and continue the good work all of you!\n  Hi there,\n\nFirst of all big thanks for this great project, it helped me and a lot of people I know.\nFor example, my girlfriend who is currently learning HTML and CSS with no computer science or programming background at all. This is the problem I would like to discuss, in level 14 the term \"Integer\" is used, probably because we engineers tend to not think too much about it. I would love to see a little explanation added for what integer means in this overlay.\n\nIf it is in your interest I would add a PR for this.\n\nHave a nice day and thanks again for this great project!\n  Current title seems not to be correct in Polish language.\n    Hey Thomas,\nThe Flexboxfroggy game was really nice so I thought I'd add a Swedish translation to it. \nCheers\n-Martin\n  Hi Thomas, please find the translation files for the Esperanto translations as well as a minor CSS mod and corrections for two small errors I spotted in the French text.\n  Maybe it's some 3rd party lib, or a plugin in my browser but it seems to be broken on Fx. Using 46.0.1.\n\n![screen shot 2016-05-25 at 10 14 23 pm](https://cloud.githubusercontent.com/assets/513460/15564373/5dd0d1a2-22c6-11e6-9f93-c503082e8e3f.png)\n Works well for me on Firefox 46.0.1 / Windows 10.\n Works on Firefox 46.0.1 on Mac OSX (10.11.3) as well.\n  I tried squashing them, but it seems like there's still the total commit history? Let me know how I might get it to the way you'd like them. Thanks!\n  I am a student at [Wyncode Academy](https://wyncode.co/).\n\nOur instructor [Auston Busen](https://github.com/abunsen) suggested your awesome game as a way to learn Flexbox.\n\nAt level 14, I answered correctly and pressed \"next\".\n\nThe language changed to Hungarian as [described here](https://slack-files.com/T055GEHEJ-F1367HS3B-15939bf286).\n\nI answered correctly and pressed \"next\" again. The language remained in Hungarian.\n\nI pressed the \"English\" link at the bottom. Still Hungarian. I pressed the \"French\" link,  and the language changed to French. I manually entered `http://flexboxfroggy.com/#en` into Chrome's location and still the language was Hungarian.\n\nI finally tried pressing \"Magyar\" and then \"English\" and the language was then in English.\n\nThanks for making Flexbox Froggy!\n  Hi Thomas, I liked your Flexbox Froggy so much that I decided to translate it to my native language as well, namely to Hungarian. I placed the 'Magyar' (Hungarian) link after the Česky as we're also located in Central Europe and we belong to that group I think. \n  There was little mistakes in spanish translations\n Oh, you're right, sorry for that, I will update the PR just with typo fixes\n  In level 15, if I use any non-zero integer after `order:`, such as `order: 1;`, the red frog goes to the right-most spot, while the lily pad stays to the very left. If I use `order: 0;`, of course, it stays in the same place, second from the right.\n\nMacbook Pro, v 10.11, Chrome v 48.0.2564.109\n Never mind, I didn't realize `order` could take negative values.\n  Hi. I've added some lines in my language. :jp: \n\nIf you don't mind following things, please just them merged. Or if you do, could you let me know? \n- I added them at the end of each list. CJK (Chinese-Japanese-Korean) are often aligned together though.\n- I'm not sure how I should treat commas at the end of lines. I put them now.\n\nThanks.\n Thank you!\n![giphy](https://cloud.githubusercontent.com/assets/355808/13718283/7171e336-e79d-11e5-92dd-1e4e85d748e4.gif)\n  edit index.html and js/game.js to import the Firebase library and to log data in the Firebase database.\n Hey @thomaspark,\n\nI just checked your message.\nBased on your request, I've made further edits.\n\nOn Thu, Feb 25, 2016 at 6:19 PM, Thomas Park notifications@github.com\nwrote:\n\n> Hey @liberaliscomputing https://github.com/liberaliscomputing, I left a\n> few comments on your PR. Thanks.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/thomaspark/flexboxfroggy/pull/62#issuecomment-189031677\n> .\n    The 'en' key was used twice in the instructions objects for a couple of levels. The second use was the Czech translation for those levels. This pull request fixes that.\n Commit message obviously referred to the wrong issue. Should have been #59.\n  here you go, new attempt ;)\n   I'll try that, but never done it before. Let's hope I don't mess it up.\n        The \"Next\" button-like-div which must be activated after completing a level cannot be reached by keyboard. Easiest and most comprehensive fix is to make it (and all other `<div class=\"button\">`) into a proper `<button>`.\n Great! I'm not sure why I didn't try \"enter\", probably because I wasn't expecting it to work in a multi-line text field, but either way `button` is a wonderful element for many reasons.\n    Lithuanian it's coming to FlexBoxFroggy! :) Happy holidays!\n  I've added Korean translation.\n   You'r welcome! you did an awesome job with this game!\n  Just solved the game and found 5 minor typing errors.\n  Typographical mistakes\n   I intentionally leave it that way! It's a little hard to explain but basically in Chinese \"level one\" doesn't make sense. \"The first level\" is correct. \"Level\" is a pretty basic word and imo it should be fine. \n    :ok_hand: \n   @thomaspark, you're welcome!\n  Awesome game. Perfect for checking our skills. :+1: \n\nAn harder mode, without saying which properties should be used would be great!\n This would be great! That's what I was thinking.\nLe 8 déc. 2015 00:08, \"Thomas Park\" notifications@github.com a écrit :\n\n> How does something like #27\n> https://github.com/thomaspark/flexboxfroggy/issues/27 sound? Repeating\n> the levels with the instructions toggled off.\n> \n> I was also thinking about a mode that generates levels with a random\n> combination of properties.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/thomaspark/flexboxfroggy/issues/35#issuecomment-162700541\n> .\n I found the first 26 steps really easy but then was stumped for about 10 minutes on 27. Maybe some steps in between would be great.\r\n\r\nBrilliant job though. created a pull request for a \"hard mode\" https://github.com/thomaspark/flexboxfroggy/pull/129\r\n  I think this is a nice change because it uses less code and also, it is being used in other parts of this same file, such as the first line: `var lang = lang || 'en';`\n  Hi @thomaspark \nI removed custom font, Now I want to add a Tahoma font, Because display is great for Persian language.\nHow do I do this?\nFor add a direction:rtl style, Changes needed to be done in CSS or HTML?\n  issue #8 \n  Changes:\n- Change French to Français just like German was changed to Deutsch in #28. (I guess Portuguese should be changed to _português_ according to Wikipedia but I don't speak the language so I didn't touch it.)\n- Change encoded entities in the German translation because they showed up as-is (`jQuery.text` function + JavaScript `confirm` function don't use HTML)\n\nI know you closed #24 (:+1: to the idea, though I didn't think localizing was that painful, but structure can't hurt anyone) so maybe you're currently changing the whole i18n structure but these commits should still trivial to implement in the new structure.\n\nThanks for the quick merge earlier! If you add anything and need new french translations, just tag me and I'll try to take care of it.\n  Done! :smile: \n  No problem, I will update the German translations in a second.\n\nHowever, I would strongly suggest to fully separate any (to-be-translated) strings from the rest of the _app_, and thus have only **one** `index.html` that reads the user's language and then uses the according strings (with a fallback to English for any missing translation). Otherwise, keeping the translations up-ot-date is a very tedious task. For instance, adding a new language would require updating also all the other `index.html` files. Having a separate file (e.g., `strings.js`, or even `strings.json`) and then _reading_ the according string is, in my opinion, the way to go.\n\n``` js\nvar strings = {\n    game: {\n        level1: {\n            en: '...',\n            de: '...',\n        }\n    },\n    messages: {\n        warningReset: {\n            en: '...',\n            de: '...',\n        }\n    }\n};\n\nvar getString = function( lang, id ) {\n    var properties = id.split( '.' ),\n        property,\n        value = strings;\n\n    while( properties.length ) {\n        property = properties.shift();\n\n        if ( ! value.property ) {\n            return 'return empty string or something else here';\n        }\n\n        value = value.property;\n    }\n\n    if ( value.lang ) {\n        return value.lang;\n    } else if( value.en ) {\n        return value.en;\n    } else {\n        return 'same error string from above or so...';\n    }\n};\n```\n\nNote this is just a quick write-up. Please don't take it as-is. :)\n  Hi Mr. Park,\n\nGreat little game! I decided to provide a french translation because I found it really helpful to quickly grasp key concepts of the flex box model, and thought it might help some students around here were it translated.\n\nHere are all of my changes:\n- Localize everything to french\n- Add localization in a new script file for unlocalized strings (\"Reset\" and its warning message)\n- Change all html files to include this new script file\n- Change root html file to link to french translation\n- Fix unclosed p tag in all languages in level \"order 1\".\n  The froggies are a bit fuzzy on my monitor, since they're PNGs.  These little buddies are perfect for SVG, composed of simple shapes and flat colors.  It'll make the filesize a little smaller, too.\n :+1: \n  This is a really awesome tutorial, good job, thanks so much!\n\nThe only suggestion is warming up to level 24 combined concepts, especially wrap-reverse. That's pretty intense!\n Figure out that `transform: scale(-1, 1)` works as a replacement for `flex-wrap: wrap-reverse`.\nOnly for this example as it's symmetrical.\n Honestly I had to cheat, look at [code](https://github.com/thomaspark/flexboxfroggy/blob/gh-pages/js/levels.js#L343) :tongue: \n Solve them all! \nVery nice play with the frogs.\nThese ex will be played plenty of times \n Yeah, considering that no level prior to level 24 has you use `wrap-reverse` (it's just mentioned in the explanatory text without having the user try it), I think it's a little too abrupt. All that's needed is an additional level after the introduction of `flex-wrap` that demonstrates `wrap-reverse` interactively.\n Also, it wouldn't hurt to have a little buildup combining a few of the concepts before the final one - including one or two that combine `order` with things like `flex-wrap`.\n +1 Agreed. I think this would be be better with some more exercises. My brain went _Woh!_ when I got to 24. I'm glad to find part of the answer here. \n\nThis is a fantastic tutorial, that still has so much more potential. I think as a learning site, a _boss level_ shows its weaknesses, rather than what it can do for the student. A number of exercises up to the _boss level_ would really reinforce the concepts and make them masters.\n\n...tempted to fork and add some, myself.\n Yeah, I didn't even know `wrap-reverse` existed until I gave up and came here via the github link on the site.\n\nI didn't think want to google for an answer since I thought I was taught everything I needed to know to complete the problem :(\n\n@SergiOnGit Here's what I ended up with after learning about `wrap-reverse`:\n\n``` css\nflex-flow: column-reverse wrap-reverse;\njustify-content: center;\nalign-content: space-between;\n```\n I think having a wrap-reverse exercise somewhere before level 24 would ease the learning curve here. 24 seems ok, for me. @ghost thanks for the solution. I was not able to find it by myself.\r\n\r\nNot sure to understand why is it the solution... Maybe provide solution with explanations could be useful in the game I agree 24 hit as a bit of a shock but it forced me to find the answer elsewhere and in the process found other resources. ```css\r\nflex-flow: column wrap;\r\njustify-content: center;\r\nalign-content: space-between;\r\ntransform: scale(-1, -1);\r\n```\r\n\r\nUpside down 🐸  working too :stuck_out_tongue_winking_eye: Besides the `wrap-reverse`, the true value of level 24 is I now know that with one class, you can do so much..... Otherwise, I will apply other class for the children.haha. Really thanks. > I agree that level 24 is pretty tough, but I intended it to be like that to give the opportunity to play around with all of the properties one last time, and as a \"boss level\" final challenge to add a sense of accomplishment.\r\n\r\nI like the concept of having a boss level, but I think there need to be just a few free-form exercises leading up to it. flex-direction: column-reverse;\r\nflex-wrap: wrap-reverse;\r\njustify-content: center;\r\nalign-content: space-between;  I like it. If you can depict direction too, you can differentiate row from row-reverse. Not sure how it can be implemented, and will have to make sure the aesthetics fit and aren't too distracting, but I'm definitely keen on the idea.\n Initially I was thinking to use the waves but I agree with you Tom, might be distracting and too much. \n\nWhat about ripples from below the leafs spreading towards the current direction?\n\nI should make some visuals to explain that... Coming soon\n Hey. Here, would visualising the axis direction as ripples on the water help people realise the difference between normal and reverse?\n![ripledirection-01](https://cloud.githubusercontent.com/assets/3190986/11869905/8767698a-a4c3-11e5-8a18-e4b6fc5d324b.jpg)\n Glad you like it :) had few other options but this one as you said is the\nmost subtle one.\n\nI was hoping the ripples could be animated out of the leaf in the direction\nof the axis and disappearing gradually. ;)\n\nRegarding the space when the leaf is close to the edge, could we add a bit\nmore, say 40-60px of padding to just show the ripples animating out towards\nthe edge?\n\nWhat do you think? Could that work?\nOn Fri, 18 Dec 2015 at 21:41, Thomas Park notifications@github.com wrote:\n\n> Visually it looks great. Fits with the style, and it's visible but subtle.\n> \n> Not sure how it would work when there's no space, like when a lilypad is\n> on the edge of the pond or there are multiply lilypads lined up.\n> \n> Also wondering how to best implement it. Perhaps grab the computed style\n> for each lilypad, then apply a class based on each's flex-direction.\n> \n> —\n> Reply to this email directly or view it on GitHub\n> https://github.com/thomaspark/flexboxfroggy/issues/20#issuecomment-165893480\n> .\n  This is to fix a mistake I made when I translated to pt-br.\n  Great Job!!! this is awesome.\n\nI think your should require semicolons in order to to solve the levels or at least a warning.\n\nThanks \n I'm also interested in the semicolon deal new programmers and veterans alike tend to accidentally leave out semicolons. If not a requirement then a helpful reminder that the person forgot would be helpful in the development of programmers learning from flexbox froggy.\n  This pull request includes the German translation.\n\nThis is **work in progress**, so don't merge right away.\n\nThe level strings are missing. I will update this as soon as possible.\n @thomaspark you're welcome. Thank **you** for this entertaining and yet educational piece of web technology. :)\n\nI'm done with translating, by the way.\n  Hi, I just finished the translation. This is my first PR, let me know if I made any mistake.\n  Now that styles are auto applied, it would be beneficial to have some type of indication that the style is invalid. Otherwise the learner is left confused on why their style is not being applied.\n\nFor example a incorrect style that looks correct on first glance:\nflex-direction: row-reversed; \n(An error I make all too much.)\n\nA problem like that would be solved by some type of indicator that a line in invalid. (Perhaps an icon to the right of the invalid line?)\n I did notice that the next button changes state, but I wonder if that is too subtle of a feedback. (Especially for beginners.) Which is why I think some way of highlighting the offending line would be helpful.\n  Redraw the frogs and improve a little color , and the contrast between them and the background , like the colors better code editor . :)\n Hi @thomaspark  these are the changes before | after :D\n![flexboxfroggy changes](https://cloud.githubusercontent.com/assets/5034252/11547309/9114265a-9918-11e5-989b-53dac23b3c84.png)\n I was going to suggest SVG to create sharper images but I was beaten too it!! :smile: However, could I suggest that svg, if implemented, keeps the png files as a fallback for visitors with browsers that don't support svg. The technique is outlined here: https://css-tricks.com/a-complete-guide-to-svg-fallbacks/ under \"Fallback for SVG ass CSS background-image\" and the code would look like\n\n``` CSS\n.lilypad.green .bg {\n  background-image: url(../images/lilypad-green.png);\n  background: url(../images/lilypad-green.svg), linear-gradient(transparent, transparent);\n}\n```\n\nHappy to provide a pull request if/when implemented. Totally love this game by the way!\n @patrickgrey Is there such a browser that doesn't support SVG but supports flexboxes? I'm just wondering why one would bother to have a fallback in case SVG is unavailable when using an even newer technology as the core of the game.\n\nCompatibility tables for reference:\n- [SVG support table](http://caniuse.com/#feat=svg)\n- [Flexbox support table](http://caniuse.com/#feat=flexbox)\n  For level 19 & 20, using `flex-direction: column;` or `flex-direction: column-reverse;` has the same effect in terms of frog-lilypad color matches, but only the former is accepted as a correct answer.\n Awesome! It's a great game, thanks for making it.\n  Instead of having to press submit every time to apply the styles and check your work. It would be beneficial if the styles auto applied allowing the learner to see their work without having to submit.\n Agree that auto applying the styles would be a nice addition. It would encourage playing with different values in the earlier levels where the values are listed.\n\nIf you went to auto applied styles then it might make sense to change the submit button to a next button, disabled by default, that becomes visibly enabled when you have the right answer?\n send the result to the ENTER key . : D\n    When you hover over `align-self` in level 16, the help text reads:\n\n> Aligns a flex item along the main axis, overriding the `align-items` value.\n\nIf I'm not mistaken, `align-self` aligns an item along the cross axis, just like `align-items` does.\n  Hi Thomas,\n\nFlexbox Froggy is insane, it's really good. I'd like to help with the Spanish translation, Do you think it's possible?\n Nice! I can help with the Brazilian Portuguese translation. :smile:\n @thomaspark sounds good!\n\nSoon I'll start the translations.\n  **How to reproduce bug**\n1. Complete any level (1~23)\n2. _Quickly_ go to next level; it works even after frogs begin to move a bit\n3. Wait a bit\n4. Level is automatically completed.\n\n---\n\n_**Aside:** Thanks for this project!_\n  Allow pressing Ctrl and the Return key at any point to run the code in the editor instead of having to click submit or use up all lines and press Return.\n Like this? :)\n No problem, thank you for a great resource :)\n  I think it's unreasonable to expect anyone to memorize all of the properties and their values in time it takes to go through first 23 steps.\n\nIt ends up being quite frustrating to break one's train of thought and state because one has to go back and look up property or value one might try.\n +1\n +1\n Game state is retained, but the mental state is not... Every time i switch away I'd have to remember what it is that I'm trying to do, and since most properties are scattered across levels, and there's no clear indication which level has which property it turns into an unnecessary hunt.\n\nLearning is not supposed to be frustrating, this is not high school :D\n I wonder if having the properties not initially shown, but showable, is a better idea. Part of what I've been looking for in a tutorial is having to memorize the names and effects of properties.\n\nAs an aside: can I just say that I _really_ _really_ like this tutorial?\n\nEDIT: After completing the tutorial, I did end up writing down the elements on a piece of paper.\n I suggest just making a legend that shows somewhere after the property has been introduced and user can see values. I had to look this up by going back a few levels after I got to level 24. The legend for quick lookup would be really helpful\n I agree with @d48. Having some sort of reference that is there only if the learner needs it would be helpful. I think a popover reference would be better then a tooltip reference, as it requires more a little more work for the learner to view it and thus would encourage them not to overuse it.\n +1, for a newcomer like me that last level is a pain, having to go back through all different levels to access the docs. \n\nSure, people could search for these docs elsewhere on the Web, but people are lazy, and it's sad loosing them because of that.\n\n> Game state is retained, but the mental state is not\n\nThis so much.\n I appreciated the boss fight ending of the last level. It was a real challenge. Great game!\n Might be in the minority, but I actually liked this because it got me to go to MDN and look up the properties, like I would have in real life :)\n\nhttps://developer.mozilla.org/en-US/docs/Web/CSS/flex-flow\nhttps://developer.mozilla.org/en-US/docs/Web/CSS/flex-wrap\n\nMaybe add a link to look up documentation instead?\n +1 to @cecyc \n\nIt is always valuable to make sure new devs know about MDN. w3schools be damned!\n  Missing word, added. :)\n\n(amazing little project by the way!)\n  So I assume 1 is the correct answer for the order, however entering 2 or 3 works too?\n oh I see, thanks!\n  Hi,\n\nCongratulations for this excellent project :gift: \n\nI made it to the last lvl, 24 of 24, but didn't notice the validation message (\"You win! Thanks to your mastery of flexbox, you were able to bring all of the frogs to safety.\") for I was focused on the frogs themselves, in the right pane.\n\nIt could be nice adding a little completion animation when the game is over.\n Excellent :)\n  None of the existing levels is using flex-grow or flex-shrink. It may be a good idea to use these more advanced features too (it may be harder to visualize them with frogs though)\n Yup would be really nice.\nGood job !\n +1\n i imagine it would be frogs being wide or slim, following this example: http://codepen.io/HugoGiraudel/pen/9a9ad8fb040f5efaf4e749b49cae7281\n Appreciate more exercises on `align-content` and `align-items` to really show the difference.\n Could draw inspiration from the story of Tiddalik the Frog (https://en.wikipedia.org/wiki/Tiddalik).\n\nIn the telling of the myth, Tiddalik awoke one morning with an unquenchable thirst, and began to drink until all the fresh water was greedily consumed. Having one frog drink much of the water and grow could be a good background for why the frogs are growing/shrinking.\n definitely it would be really nice to have some levels for flex-grow, flex-shrink and flex-basis and their shorthand.", "text_all_count": 6554, "text_word_token": ["Saw", "the", "settings", "update", "and", "decided", "to", "add", "Latvian", "translation", "right", "away", "NUMBER", "While", "playing", "through", "to", "recheck", "my", "previous", "translation", "find", "that", "some", "more", "error", "and", "fix", "them", "as", "well", "NUMBER", "Enjoy", "Though", "the", "settings", "translation", "works", "perfectly", "there", "be", "still", "some", "problem", "with", "level", "number", "NUMBER", "in", "Latvian", "version", "NUMBER", "I", "thought", "that", "add", "the", "miss", "paragraph", "tag", "would", "fix", "it", "but", "apparently", "it", "doesn", "t", "NUMBER", "From", "what", "I", "can", "see", "it", "looks", "equally", "formatted", "to", "other", "translations", "that", "work", "just", "as", "expected", "NUMBER", "In", "docs", "NUMBER", "js", "line", "NUMBER", "Stops", "execution", "of", "js", "and", "seems", "to", "break", "hover", "tooltips", "NUMBER", "Added", "Latvian", "translations", "NUMBER", "Deletions", "that", "show", "up", "in", "file", "be", "simply", "add", "commas", "after", "Macedonian", "translations", "NUMBER", "I", "re", "did", "this", "twice", "thinking", "that", "it", "may", "have", "be", "something", "on", "my", "end", "only", "to", "realize", "that", "everything", "seems", "to", "work", "fine", "just", "difference", "looks", "weird", "NUMBER", "If", "anyone", "has", "suggestions", "how", "to", "avoid", "this", "here", "or", "in", "future", "let", "me", "know", "NUMBER", "This", "be", "my", "first", "contribution", "to", "open", "source", "and", "I", "pick", "this", "project", "because", "it", "really", "helped", "me", "to", "improve", "my", "knowledge", "and", "application", "of", "CSS", "flexbox", "NUMBER", "Thanks", "though", "right", "now", "it", "still", "shows", "english", "version", "when", "I", "choose", "Latvian", "on", "the", "site", "Yes", "that", "was", "the", "case", "Thanks", "This", "PR", "add", "a", "color", "blind", "friendly", "mode", "NUMBER", "Dark", "shapes", "be", "add", "to", "the", "frogs", "bellies", "and", "corresponding", "lily", "pads", "so", "that", "frogs", "can", "be", "matched", "by", "the", "shape", "rather", "than", "by", "the", "color", "NUMBER", "TAG", "A", "button", "be", "add", "below", "the", "code", "entry", "box", "to", "toggle", "the", "mode", "on", "or", "off", "NUMBER", "The", "setting", "be", "stored", "in", "localStorage", "NUMBER", "This", "be", "achieved", "by", "loading", "in", "different", "SVG", "file", "for", "the", "frog", "div", "backgrounds", "NUMBER", "Since", "we", "re", "loading", "SVG", "images", "as", "a", "background", "I", "didn", "t", "see", "any", "clean", "way", "of", "dynamically", "add", "the", "new", "shapes", "to", "the", "SVG", "NUMBER", "This", "has", "be", "test", "by", "a", "student", "of", "mine", "with", "red", "green", "colorblindness", "and", "gets", "his", "thumbs", "up", "NUMBER", "If", "you", "want", "to", "try", "it", "for", "yourself", "LINK", "Resolves", "NUMBER", "Yeah", "maybe", "I", "did", "overstate", "it", "a", "little", "thanks", "for", "the", "feedback", "Deprecate", "NUMBER", "importing", "the", "Parse", "library", "in", "index", "NUMBER", "html", "and", "NUMBER", "corresponding", "code", "in", "js", "game", "NUMBER", "js", "Add", "Macedonian", "language", "translations", "NUMBER", "Created", "a", "separate", "pull", "request", "as", "I", "don", "t", "think", "it", "was", "relate", "to", "the", "easy", "hard", "mode", "PR", "You", "will", "have", "to", "merge", "both", "PR", "s", "for", "it", "to", "fix", "the", "hardmode", "NUMBER", "i", "NUMBER", "e", "merge", "in", "this", "first", "then", "the", "hardmode", "NUMBER", "On", "Tue", "Feb", "NUMBER", "NUMBER", "at", "NUMBER", "NUMBER", "PM", "Thomas", "Park", "TAG", "write", "Merged", "NUMBER", "TAG", "NUMBER", "You", "be", "receiving", "this", "because", "you", "authored", "the", "thread", "NUMBER", "Reply", "to", "this", "email", "directly", "view", "it", "on", "GitHub", "TAG", "or", "mute", "the", "thread", "TAG", "NUMBER", "When", "in", "hard", "mode", "hide", "instructions", "and", "go", "to", "random", "level", "medium", "just", "hide", "instructions", "easy", "normal", "Sure", "thing", "NUMBER", "Glad", "you", "like", "it", "On", "Mon", "Jan", "NUMBER", "NUMBER", "at", "NUMBER", "NUMBER", "PM", "Thomas", "Park", "TAG", "write", "Hey", "mcshiz", "TAG", "thanks", "for", "this", "pull", "request", "looks", "good", "and", "I", "love", "the", "idea", "of", "randomizing", "levels", "on", "top", "of", "hiding", "the", "instructions", "NUMBER", "One", "issue", "be", "that", "it", "won", "t", "be", "immediately", "obvious", "what", "the", "different", "levels", "do", "NUMBER", "How", "about", "if", "we", "do", "a", "pop", "up", "like", "for", "languages", "for", "Beginner", "Intermediate", "Advanced", "with", "short", "descriptions", "of", "what", "each", "do", "NUMBER", "Would", "you", "be", "up", "for", "work", "on", "that", "You", "be", "receiving", "this", "because", "you", "were", "mention", "NUMBER", "Reply", "to", "this", "email", "directly", "view", "it", "on", "GitHub", "TAG", "or", "mute", "the", "thread", "TAG", "NUMBER", "Ok", "I", "add", "some", "directions", "to", "a", "tooltip", "like", "the", "languages", "Any", "update", "on", "this", "Fix", "some", "typo", "miss", "parts", "and", "translation", "mistakes", "Update", "the", "instruction", "text", "on", "winner", "page", "to", "be", "up", "to", "date", "PS", "NUMBER", "I", "be", "native", "Mandarin", "speaker", "NUMBER", "Same", "as", "LINK", "fix", "typo", "親哇", "青蛙", "I", "finished", "the", "Greek", "translation", "for", "Flexbox", "Froggy", "NUMBER", "Please", "let", "me", "know", "in", "case", "there", "be", "anything", "that", "needs", "fix", "NUMBER", "image", "LINK", "images", "NUMBER", "githubusercontent", "NUMBER", "com", "NUMBER", "NUMBER", "NUMBER", "b", "NUMBER", "bb", "NUMBER", "a", "NUMBER", "e", "NUMBER", "NUMBER", "f", "ffc", "NUMBER", "a", "NUMBER", "a", "NUMBER", "png", "yeah", "I", "figured", "it", "out", "NUMBER", "They", "were", "due", "to", "the", "addons", "NUMBER", "welcome", "On", "Wed", "Jan", "NUMBER", "NUMBER", "at", "NUMBER", "NUMBER", "PM", "Thomas", "Park", "TAG", "write", "Thanks", "NUMBER", "You", "be", "receiving", "this", "because", "you", "authored", "the", "thread", "NUMBER", "Reply", "to", "this", "email", "directly", "view", "it", "on", "GitHub", "TAG", "or", "mute", "the", "thread", "TAG", "NUMBER", "Loved", "your", "tutorial", "NUMBER", "My", "mother", "tongue", "Malayalam", "was", "miss", "from", "the", "language", "list", "NUMBER", "I", "have", "add", "translations", "for", "the", "aforementioned", "language", "NUMBER", "Fixes", "NUMBER", "thomaspark", "here", "be", "a", "quick", "PR", "to", "fill", "the", "container", "height", "of", "the", "line", "numbers", "class", "NUMBER", "When", "looking", "at", "the", "container", "for", "code", "there", "seems", "to", "be", "a", "hairline", "gap", "at", "the", "bottom", "of", "the", "code", "lines", "NUMBER", "Adding", "height", "NUMBER", "to", "the", "NUMBER", "line", "numbers", "class", "seems", "to", "fix", "this", "NUMBER", "I", "wanted", "to", "post", "this", "here", "in", "the", "event", "that", "it", "was", "helpful", "NUMBER", "Happy", "to", "make", "a", "PR", "if", "desired", "NUMBER", "Without", "height", "NUMBER", "image", "LINK", "images", "NUMBER", "githubusercontent", "NUMBER", "com", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "a", "NUMBER", "NUMBER", "e", "NUMBER", "NUMBER", "NUMBER", "f", "NUMBER", "cea", "NUMBER", "bd", "NUMBER", "e", "NUMBER", "png", "With", "height", "NUMBER", "image", "LINK", "images", "NUMBER", "githubusercontent", "NUMBER", "com", "NUMBER", "NUMBER", "NUMBER", "ef", "NUMBER", "a", "NUMBER", "e", "NUMBER", "a", "NUMBER", "NUMBER", "e", "NUMBER", "NUMBER", "f", "NUMBER", "NUMBER", "e", "NUMBER", "f", "NUMBER", "f", "NUMBER", "png", "There", "be", "an", "error", "when", "loading", "page", "NUMBER", "Seems", "to", "be", "happening", "only", "on", "Chrome", "and", "recently", "about", "a", "week", "ago", "NUMBER", "Uncaught", "ReferenceError", "Parse", "be", "not", "defined", "at", "game", "NUMBER", "js", "NUMBER", "Parse", "NUMBER", "initialize", "FwVMmzHookZZ", "NUMBER", "j", "NUMBER", "F", "NUMBER", "ILc", "NUMBER", "E", "NUMBER", "MT", "NUMBER", "ufabuV", "NUMBER", "hCXKSeu", "Browser", "Chrome", "Version", "NUMBER", "Official", "Build", "NUMBER", "bit", "OS", "macOs", "Sierra", "NUMBER", "It", "happens", "even", "if", "I", "try", "a", "hard", "reload", "from", "dev", "mode", "NUMBER", "My", "bad", "NUMBER", "In", "incognito", "mode", "it", "do", "work", "NUMBER", "I", "ve", "tried", "clearing", "the", "entire", "cache", "of", "my", "browser", "I", "ve", "also", "manually", "cleared", "the", "cache", "data", "and", "local", "storage", "data", "for", "the", "page", "but", "it", "still", "happens", "NUMBER", "What", "could", "be", "happening", "here", "Cheers", "NUMBER", "You", "be", "totally", "right", "NUMBER", "Stands", "app", "was", "blocking", "LINK", "site", "NUMBER", "Thanks", "a", "lot", "for", "your", "support", "NUMBER", "Regards", "NUMBER", "Would", "be", "nice", "to", "provide", "a", "solution", "explanation", "for", "anyone", "who", "simply", "cannot", "figure", "one", "out", "Level", "NUMBER", "I", "expected", "order", "NUMBER", "or", "order", "NUMBER", "to", "move", "the", "red", "frog", "to", "the", "first", "lilypad", "NUMBER", "To", "be", "sure", "order", "NUMBER", "do", "put", "the", "red", "frog", "on", "the", "NUMBER", "lilypad", "ie", "nothing", "be", "reversed", "NUMBER", "However", "_any", "other", "value_", "for", "order", "keep", "the", "red", "frog", "on", "the", "NUMBER", "starting", "lilypad", "I", "cannot", "get", "it", "to", "move", "to", "NUMBER", "NUMBER", "or", "NUMBER", "lilypad", "with", "order", "NUMBER", "order", "NUMBER", "or", "order", "NUMBER", "or", "order", "NUMBER", "NUMBER", "All", "other", "levels", "work", "fine", "for", "me", "though", "level", "NUMBER", "vexed", "me", "with", "wrap", "reverse", "NUMBER", "Am", "I", "just", "miss", "something", "obvious", "I", "m", "use", "chrome", "on", "win", "NUMBER", "in", "full", "screen", "NUMBER", "I", "see", "now", "that", "I", "misunderstood", "how", "order", "works", "NUMBER", "The", "first", "order", "exercise", "gave", "me", "a", "false", "impression", "that", "I", "understood", "how", "it", "worked", "as", "order", "NUMBER", "was", "correct", "NUMBER", "Being", "forced", "to", "move", "the", "frog", "to", "the", "first", "position", "on", "the", "first", "exercise", "would", "have", "be", "more", "beneficial", "IMHO", "NUMBER", "There", "would", "be", "no", "ambiguity", "of", "a", "wrong", "answer", "appearing", "correct", "and", "be", "accepted", "as", "correct", "NUMBER", "Additionally", "the", "instructions", "on", "the", "previous", "page", "clearly", "point", "out", "that", "all", "items", "have", "a", "default", "order", "of", "NUMBER", "so", "trying", "NUMBER", "would", "have", "be", "a", "natural", "choice", "NUMBER", "By", "the", "time", "I", "get", "to", "this", "exercise", "I", "no", "longer", "had", "this", "clue", "and", "I", "had", "false", "idea", "of", "how", "it", "worked", "NUMBER", "NUMBER", "arting", "from", "the", "lowest", "numbered", "ordinal", "group", "and", "going", "up", "NUMBER", "Items", "with", "the", "same", "ordinal", "group", "be", "laid", "out", "in", "the", "order", "they", "appear", "in", "the", "source", "document", "NUMBER", "at", "LINK", "_reference", "flexbox", "section_order", "clarified", "this", "for", "me", "NUMBER", "Also", "swapping", "the", "order", "of", "the", "two", "order", "exercises", "might", "have", "be", "helpful", "NUMBER", "Add", "romanian", "language", "and", "reordered", "language", "menu", "NUMBER", "Done", "NUMBER", "I", "realized", "Persian", "translation", "had", "some", "typo", "error", "so", "I", "ve", "fix", "it", "NUMBER", "You", "re", "welcome", "NUMBER", "I", "d", "be", "glad", "to", "help", "even", "a", "little", "bit", "I", "just", "completed", "the", "game", "and", "it", "be", "very", "informative", "NUMBER", "I", "like", "how", "the", "challenges", "get", "progressively", "more", "difficult", "while", "maintaining", "the", "option", "for", "help", "with", "the", "hovers", "you", "really", "did", "a", "good", "job", "of", "it", "The", "thing", "with", "learning", "something", "new", "be", "that", "there", "be", "no", "way", "of", "remembering", "this", "stuff", "without", "repetition", "at", "the", "end", "of", "the", "game", "the", "user", "be", "told", "that", "they", "have", "do", "well", "and", "be", "sent", "on", "their", "way", "my", "first", "feature", "request", "would", "be", "a", "cheat", "sheet", "that", "they", "can", "download", "to", "help", "them", "remember", "what", "they", "have", "learned", "NUMBER", "It", "would", "be", "good", "if", "the", "contributors", "could", "make", "one", "that", "be", "frog", "themed", "NUMBER", "Or", "with", "the", "authors", "permissions", "we", "could", "add", "links", "to", "an", "exist", "cheat", "sheet", "such", "as", "one", "of", "the", "following", "LINK", "tricks", "NUMBER", "com", "snippets", "css", "a", "guide", "to", "flexbox", "LINK", "cheatsheet", "LINK", "cheatsheet", "Secondly", "even", "if", "the", "user", "gets", "the", "correct", "answer", "they", "may", "not", "understand", "the", "logic", "that", "be", "why", "websites", "such", "as", "Code", "Academy", "and", "Udacity", "have", "answer", "text", "videos", "respectively", "to", "explain", "the", "logic", "behind", "the", "answer", "NUMBER", "Maybe", "you", "could", "have", "an", "explanation", "of", "the", "answer", "shown", "once", "the", "user", "has", "answered", "correctly", "just", "to", "walk", "them", "though", "the", "logic", "NUMBER", "I", "realise", "that", "I", "have", "touched", "on", "a", "lot", "of", "points", "here", "I", "would", "quite", "happily", "be", "a", "contributor", "to", "your", "project", "I", "m", "just", "putting", "my", "thoughts", "on", "the", "table", "NUMBER", "Change", "estirán", "by", "estiran", "Is", "there", "a", "way", "to", "play", "this", "game", "more", "than", "once", "Reloading", "and", "clearing", "out", "the", "storage", "doesn", "t", "seem", "to", "make", "a", "difference", "NUMBER", "Every", "level", "be", "always", "already", "completed", "NUMBER", "Oh", "cool", "NUMBER", "I", "totally", "miss", "that", "Haha", "Thanks", "I", "could", "translate", "but", "left", "it", "in", "English", "because", "the", "phrase", "be", "usually", "write", "in", "English", "in", "Japanese", "culture", "NUMBER", "I", "m", "sure", "that", "most", "Japanese", "understand", "it", "and", "feel", "comfortable", "NUMBER", "But", "do", "you", "want", "me", "to", "add", "a", "comment", "there", "to", "make", "it", "clear", "Added", "Tamil", "Language", "Translations", "Hey", "gbhasha", "thanks", "for", "the", "Tamil", "translation", "NUMBER", "Couple", "things", "docs", "NUMBER", "js", "which", "contains", "the", "property", "definitions", "also", "needs", "to", "be", "translated", "NUMBER", "In", "readme", "the", "Tamil", "line", "should", "be", "put", "alphabetically", "with", "the", "other", "languages", "NUMBER", "Once", "these", "change", "be", "made", "I", "ll", "merge", "it", "in", "Added", "Tamil", "Translation", "NUMBER", "Learning", "and", "recalling", "flexbox", "layout", "properties", "with", "Flexbox", "Froggy", "be", "fun", "Now", "grid", "layout", "be", "here", "LINK", "search", "grid", "LINK", "tricks", "NUMBER", "com", "snippets", "css", "complete", "guide", "grid", "And", "it", "be", "already", "can", "be", "use", "with", "support", "display", "grid", "It", "would", "be", "great", "to", "adapt", "Froggy", "to", "the", "new", "css", "layout", "module", "or", "make", "a", "new", "project", "e", "NUMBER", "g", "NUMBER", "Grid", "Giraffe", "with", "variable", "neck", "sizes", "Wow", "just", "wow", "great", "work", "The", "garden", "theme", "be", "suited", "even", "more", "Thanks", "On", "Apr", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "Thomas", "Park", "TAG", "write", "image", "gridgarden", "TAG", "Just", "put", "the", "finishing", "touches", "on", "Grid", "Garden", "LINK", "LINK", "Loved", "the", "Grid", "Giraffe", "idea", "but", "sadly", "couldn", "t", "get", "it", "to", "work", "NUMBER", "You", "be", "receiving", "this", "because", "you", "authored", "the", "thread", "NUMBER", "Reply", "to", "this", "email", "directly", "view", "it", "on", "GitHub", "TAG", "or", "mute", "the", "thread", "TAG", "NUMBER", "Hi", "Thomas", "I", "liked", "your", "Flexbox", "Froggy", "so", "much", "that", "I", "decided", "to", "translate", "it", "to", "my", "native", "language", "Serbian", "NUMBER", "Thank", "you", "for", "your", "hard", "work", "and", "awesome", "idea", "NUMBER", "Best", "Danko", "Hey", "Thomas", "it", "s", "do", "If", "you", "need", "me", "to", "make", "more", "adjustments", "I", "will", "be", "happy", "to", "do", "it", "NUMBER", "Good", "catch", "Since", "I", "have", "be", "translating", "from", "English", "maybe", "a", "word", "hoppy", "also", "need", "correction", "LINK", "pages", "js", "levels", "NUMBER", "js", "L", "NUMBER", "Awesome", "It", "was", "my", "pleasure", "Thomas", "NUMBER", "Hey", "Thomas", "The", "Flexboxfroggy", "game", "be", "really", "cool", "game", "I", "learnt", "a", "lot", "NUMBER", "I", "thought", "I", "d", "add", "a", "Hindi", "translation", "to", "it", "NUMBER", "Shubham", "extra", "syllable", "in", "a", "word", "запутать", "Welcome", "This", "be", "the", "recommended", "way", "now", "and", "the", "default", "Google", "provide", "NUMBER", "The", "MIT", "license", "present", "in", "this", "repo", "only", "mentions", "software", "and", "documentation", "NUMBER", "What", "about", "the", "images", "If", "I", "stole", "them", "for", "some", "other", "project", "would", "that", "be", "okay", "A", "small", "parenthetical", "phrase", "would", "suffice", "NUMBER", "to", "any", "person", "obtaining", "a", "copy", "of", "this", "software", "include", "media", "file", "and", "associated", "documentation", "file", "NUMBER", "NUMBER", "Can", "you", "make", "a", "color", "blind", "color", "deficient", "mode", "It", "s", "extremely", "difficult", "for", "some", "people", "to", "see", "the", "difference", "between", "the", "red", "and", "green", "frogs", "and", "lilly", "pads", "NUMBER", "Thanks", "for", "considering", "Excellent", "learning", "resources", "NUMBER", "Just", "change", "the", "green", "frog", "and", "target", "pad", "to", "blue", "NUMBER", "Like", "this", "NUMBER", "LINK", "That", "will", "fix", "the", "most", "common", "color", "blindness", "red", "green", "Then", "you", "can", "keep", "add", "incremental", "schemes", "for", "the", "other", "form", "NUMBER", "Looks", "like", "you", "could", "add", "a", "checkbox", "add", "the", "CSS", "for", "the", "new", "assets", "then", "swap", "your", "color", "object", "if", "it", "be", "selected", "to", "g", "blue", "I", "m", "a", "newb", "and", "only", "have", "free", "web", "tool", "but", "I", "ll", "throw", "together", "what", "I", "would", "know", "how", "to", "do", "so", "you", "can", "see", "what", "direction", "I", "would", "come", "from", "NUMBER", "Just", "a", "suggestion", "To", "write", "a", "number", "in", "the", "on", "the", "frogs", "stomach", "and", "on", "the", "corresponding", "leaf", "if", "not", "the", "change", "of", "color", "NUMBER", "Hi", "there", "As", "promised", "a", "PR", "NUMBER", "I", "thought", "that", "simply", "giving", "an", "example", "for", "an", "integer", "value", "might", "clear", "it", "up", "for", "people", "new", "to", "the", "industry", "NUMBER", "I", "checked", "every", "translation", "for", "visual", "bug", "and", "I", "be", "not", "sure", "if", "the", "farsi", "one", "makes", "sense", "this", "whole", "right", "to", "left", "thing", "confuses", "me", "maybe", "alihaddadkar", "may", "have", "a", "look", "at", "it", "NUMBER", "Have", "a", "nice", "day", "and", "continue", "the", "good", "work", "all", "of", "you", "Hi", "there", "First", "of", "all", "big", "thanks", "for", "this", "great", "project", "it", "helped", "me", "and", "a", "lot", "of", "people", "I", "know", "NUMBER", "For", "example", "my", "girlfriend", "who", "be", "currently", "learning", "HTML", "and", "CSS", "with", "no", "computer", "science", "or", "programming", "background", "at", "all", "NUMBER", "This", "be", "the", "problem", "I", "would", "like", "to", "discuss", "in", "level", "NUMBER", "the", "term", "Integer", "be", "use", "probably", "because", "we", "engineers", "tend", "to", "not", "think", "too", "much", "about", "it", "NUMBER", "I", "would", "love", "to", "see", "a", "little", "explanation", "add", "for", "what", "integer", "means", "in", "this", "overlay", "NUMBER", "If", "it", "be", "in", "your", "interest", "I", "would", "add", "a", "PR", "for", "this", "NUMBER", "Have", "a", "nice", "day", "and", "thanks", "again", "for", "this", "great", "project", "Current", "title", "seems", "not", "to", "be", "correct", "in", "Polish", "language", "NUMBER", "Hey", "Thomas", "The", "Flexboxfroggy", "game", "was", "really", "nice", "so", "I", "thought", "I", "d", "add", "a", "Swedish", "translation", "to", "it", "NUMBER", "Cheers", "Martin", "Hi", "Thomas", "please", "find", "the", "translation", "file", "for", "the", "Esperanto", "translations", "as", "well", "as", "a", "minor", "CSS", "mod", "and", "corrections", "for", "two", "small", "error", "I", "spotted", "in", "the", "French", "text", "NUMBER", "Maybe", "it", "s", "some", "NUMBER", "party", "lib", "or", "a", "plugin", "in", "my", "browser", "but", "it", "seems", "to", "be", "broken", "on", "Fx", "NUMBER", "Using", "NUMBER", "screen", "shot", "NUMBER", "NUMBER", "NUMBER", "at", "NUMBER", "NUMBER", "NUMBER", "pm", "LINK", "NUMBER", "c", "NUMBER", "NUMBER", "e", "NUMBER", "NUMBER", "f", "NUMBER", "c", "NUMBER", "e", "NUMBER", "e", "NUMBER", "f", "NUMBER", "png", "Works", "well", "for", "me", "on", "Firefox", "NUMBER", "Windows", "NUMBER", "Works", "on", "Firefox", "NUMBER", "on", "Mac", "OSX", "NUMBER", "as", "well", "NUMBER", "I", "tried", "squashing", "them", "but", "it", "seems", "like", "there", "s", "still", "the", "total", "commit", "history", "Let", "me", "know", "how", "I", "might", "get", "it", "to", "the", "way", "you", "d", "like", "them", "NUMBER", "Thanks", "I", "be", "a", "student", "at", "Wyncode", "Academy", "LINK", "NUMBER", "Our", "instructor", "Auston", "Busen", "LINK", "suggested", "your", "awesome", "game", "as", "a", "way", "to", "learn", "Flexbox", "NUMBER", "At", "level", "NUMBER", "I", "answered", "correctly", "and", "pressed", "next", "NUMBER", "The", "language", "change", "to", "Hungarian", "as", "describe", "here", "LINK", "file", "NUMBER", "com", "T", "NUMBER", "GEHEJ", "F", "NUMBER", "HS", "NUMBER", "B", "NUMBER", "bf", "NUMBER", "NUMBER", "I", "answered", "correctly", "and", "pressed", "next", "again", "NUMBER", "The", "language", "remained", "in", "Hungarian", "NUMBER", "I", "pressed", "the", "English", "link", "at", "the", "bottom", "NUMBER", "Still", "Hungarian", "NUMBER", "I", "pressed", "the", "French", "link", "and", "the", "language", "change", "to", "French", "NUMBER", "I", "manually", "entered", "LINK", "en", "into", "Chrome", "s", "location", "and", "still", "the", "language", "was", "Hungarian", "NUMBER", "I", "finally", "tried", "pressing", "Magyar", "and", "then", "English", "and", "the", "language", "was", "then", "in", "English", "NUMBER", "Thanks", "for", "make", "Flexbox", "Froggy", "Hi", "Thomas", "I", "liked", "your", "Flexbox", "Froggy", "so", "much", "that", "I", "decided", "to", "translate", "it", "to", "my", "native", "language", "as", "well", "namely", "to", "Hungarian", "NUMBER", "I", "placed", "the", "Magyar", "Hungarian", "link", "after", "the", "Česky", "as", "we", "re", "also", "located", "in", "Central", "Europe", "and", "we", "belong", "to", "that", "group", "I", "think", "NUMBER", "There", "was", "little", "mistakes", "in", "spanish", "translations", "Oh", "you", "re", "right", "sorry", "for", "that", "I", "will", "update", "the", "PR", "just", "with", "typo", "fix", "In", "level", "NUMBER", "if", "I", "use", "any", "non", "zero", "integer", "after", "order", "such", "as", "order", "NUMBER", "the", "red", "frog", "goes", "to", "the", "right", "most", "spot", "while", "the", "lily", "pad", "stays", "to", "the", "very", "left", "NUMBER", "If", "I", "use", "order", "NUMBER", "of", "course", "it", "stays", "in", "the", "same", "place", "second", "from", "the", "right", "NUMBER", "Macbook", "Pro", "v", "NUMBER", "Chrome", "v", "NUMBER", "Never", "mind", "I", "didn", "t", "realize", "order", "could", "take", "negative", "values", "NUMBER", "Hi", "NUMBER", "I", "ve", "add", "some", "lines", "in", "my", "language", "NUMBER", "jp", "If", "you", "don", "t", "mind", "following", "things", "please", "just", "them", "merge", "NUMBER", "Or", "if", "you", "do", "could", "you", "let", "me", "know", "I", "add", "them", "at", "the", "end", "of", "each", "list", "NUMBER", "CJK", "Chinese", "Japanese", "Korean", "be", "often", "aligned", "together", "though", "NUMBER", "I", "m", "not", "sure", "how", "I", "should", "treat", "commas", "at", "the", "end", "of", "lines", "NUMBER", "I", "put", "them", "now", "NUMBER", "Thanks", "NUMBER", "Thank", "you", "giphy", "LINK", "e", "NUMBER", "d", "NUMBER", "e", "NUMBER", "NUMBER", "dd", "NUMBER", "e", "NUMBER", "e", "NUMBER", "d", "NUMBER", "e", "NUMBER", "gif", "edit", "index", "NUMBER", "html", "and", "js", "game", "NUMBER", "js", "to", "import", "the", "Firebase", "library", "and", "to", "log", "data", "in", "the", "Firebase", "database", "NUMBER", "Hey", "thomaspark", "I", "just", "checked", "your", "message", "NUMBER", "Based", "on", "your", "request", "I", "ve", "made", "further", "edits", "NUMBER", "On", "Thu", "Feb", "NUMBER", "NUMBER", "at", "NUMBER", "NUMBER", "PM", "Thomas", "Park", "notifications", "github", "NUMBER", "com", "write", "Hey", "liberaliscomputing", "LINK", "I", "left", "a", "few", "comments", "on", "your", "PR", "NUMBER", "Thanks", "NUMBER", "Reply", "to", "this", "email", "directly", "or", "view", "it", "on", "GitHub", "LINK", "issuecomment", "NUMBER", "NUMBER", "The", "en", "key", "was", "use", "twice", "in", "the", "instructions", "objects", "for", "a", "couple", "of", "levels", "NUMBER", "The", "second", "use", "was", "the", "Czech", "translation", "for", "those", "levels", "NUMBER", "This", "pull", "request", "fix", "that", "NUMBER", "Commit", "message", "obviously", "referred", "to", "the", "wrong", "issue", "NUMBER", "Should", "have", "be", "NUMBER", "here", "you", "go", "new", "attempt", "I", "ll", "try", "that", "but", "never", "do", "it", "before", "NUMBER", "Let", "s", "hope", "I", "don", "t", "mess", "it", "up", "NUMBER", "The", "Next", "button", "like", "div", "which", "must", "be", "activated", "after", "completing", "a", "level", "cannot", "be", "reached", "by", "keyboard", "NUMBER", "Easiest", "and", "most", "comprehensive", "fix", "be", "to", "make", "it", "and", "all", "other", "TAG", "into", "a", "proper", "TAG", "NUMBER", "Great", "I", "m", "not", "sure", "why", "I", "didn", "t", "try", "enter", "probably", "because", "I", "wasn", "t", "expecting", "it", "to", "work", "in", "a", "multi", "line", "text", "field", "but", "either", "way", "button", "be", "a", "wonderful", "element", "for", "many", "reasons", "NUMBER", "Lithuanian", "it", "s", "come", "to", "FlexBoxFroggy", "Happy", "holidays", "I", "ve", "add", "Korean", "translation", "NUMBER", "You", "r", "welcome", "you", "did", "an", "awesome", "job", "with", "this", "game", "Just", "solve", "the", "game", "and", "find", "NUMBER", "minor", "typing", "error", "NUMBER", "Typographical", "mistakes", "I", "intentionally", "leave", "it", "that", "way", "It", "s", "a", "little", "hard", "to", "explain", "but", "basically", "in", "Chinese", "level", "one", "doesn", "t", "make", "sense", "NUMBER", "The", "first", "level", "be", "correct", "NUMBER", "Level", "be", "a", "pretty", "basic", "word", "and", "imo", "it", "should", "be", "fine", "NUMBER", "ok_hand", "thomaspark", "you", "re", "welcome", "Awesome", "game", "NUMBER", "Perfect", "for", "checking", "our", "skills", "NUMBER", "NUMBER", "An", "harder", "mode", "without", "saying", "which", "properties", "should", "be", "use", "would", "be", "great", "This", "would", "be", "great", "That", "s", "what", "I", "was", "thinking", "NUMBER", "Le", "NUMBER", "déc", "NUMBER", "NUMBER", "NUMBER", "NUMBER", "Thomas", "Park", "notifications", "github", "NUMBER", "com", "a", "écrit", "How", "do", "something", "like", "NUMBER", "LINK", "sound", "Repeating", "the", "levels", "with", "the", "instructions", "toggled", "off", "NUMBER", "I", "was", "also", "thinking", "about", "a", "mode", "that", "generates", "levels", "with", "a", "random", "combination", "of", "properties", "NUMBER", "Reply", "to", "this", "email", "directly", "or", "view", "it", "on", "GitHub", "LINK", "issuecomment", "NUMBER", "NUMBER", "I", "find", "the", "first", "NUMBER", "steps", "really", "easy", "but", "then", "was", "stumped", "for", "about", "NUMBER", "minutes", "on", "NUMBER", "Maybe", "some", "steps", "in", "between", "would", "be", "great", "NUMBER", "Brilliant", "job", "though", "NUMBER", "created", "a", "pull", "request", "for", "a", "hard", "mode", "LINK", "I", "think", "this", "be", "a", "nice", "change", "because", "it", "uses", "less", "code", "and", "also", "it", "be", "be", "use", "in", "other", "parts", "of", "this", "same", "file", "such", "as", "the", "first", "line", "var", "lang", "lang", "en", "Hi", "thomaspark", "I", "remove", "custom", "font", "Now", "I", "want", "to", "add", "a", "Tahoma", "font", "Because", "display", "be", "great", "for", "Persian", "language", "NUMBER", "How", "do", "I", "do", "this", "For", "add", "a", "direction", "rtl", "style", "Changes", "needed", "to", "be", "do", "in", "CSS", "or", "HTML", "issue", "NUMBER", "Changes", "Change", "French", "to", "Français", "just", "like", "German", "was", "change", "to", "Deutsch", "in", "NUMBER", "I", "guess", "Portuguese", "should", "be", "change", "to", "_português_", "according", "to", "Wikipedia", "but", "I", "don", "t", "speak", "the", "language", "so", "I", "didn", "t", "touch", "it", "NUMBER", "Change", "encoded", "entities", "in", "the", "German", "translation", "because", "they", "showed", "up", "as", "be", "jQuery", "NUMBER", "text", "function", "JavaScript", "confirm", "function", "don", "t", "use", "HTML", "I", "know", "you", "close", "NUMBER", "NUMBER", "to", "the", "idea", "though", "I", "didn", "t", "think", "localizing", "was", "that", "painful", "but", "structure", "can", "t", "hurt", "anyone", "so", "maybe", "you", "re", "currently", "change", "the", "whole", "i", "NUMBER", "n", "structure", "but", "these", "commit", "should", "still", "trivial", "to", "implement", "in", "the", "new", "structure", "NUMBER", "Thanks", "for", "the", "quick", "merge", "earlier", "If", "you", "add", "anything", "and", "need", "new", "french", "translations", "just", "tag", "me", "and", "I", "ll", "try", "to", "take", "care", "of", "it", "NUMBER", "Done", "smile", "No", "problem", "I", "will", "update", "the", "German", "translations", "in", "a", "second", "NUMBER", "However", "I", "would", "strongly", "suggest", "to", "fully", "separate", "any", "to", "be", "translated", "strings", "from", "the", "rest", "of", "the", "_app_", "and", "thus", "have", "only", "one", "index", "NUMBER", "html", "that", "reads", "the", "user", "s", "language", "and", "then", "uses", "the", "according", "strings", "with", "a", "fallback", "to", "English", "for", "any", "miss", "translation", "NUMBER", "Otherwise", "keep", "the", "translations", "up", "ot", "date", "be", "a", "very", "tedious", "task", "NUMBER", "For", "instance", "add", "a", "new", "language", "would", "require", "update", "also", "all", "the", "other", "index", "NUMBER", "html", "file", "NUMBER", "Having", "a", "separate", "file", "e", "NUMBER", "g", "NUMBER", "strings", "NUMBER", "js", "or", "even", "strings", "NUMBER", "json", "and", "then", "_reading_", "the", "according", "string", "be", "in", "my", "opinion", "the", "way", "to", "go", "NUMBER", "js", "var", "strings", "game", "level", "NUMBER", "en", "NUMBER", "de", "NUMBER", "message", "warningReset", "en", "NUMBER", "de", "NUMBER", "var", "getString", "function", "lang", "id", "var", "properties", "id", "NUMBER", "split", "NUMBER", "property", "value", "strings", "while", "properties", "NUMBER", "length", "property", "properties", "NUMBER", "shift", "if", "value", "NUMBER", "property", "return", "return", "empty", "string", "or", "something", "else", "here", "value", "value", "NUMBER", "property", "if", "value", "NUMBER", "lang", "return", "value", "NUMBER", "lang", "else", "if", "value", "NUMBER", "en", "return", "value", "NUMBER", "en", "else", "return", "same", "error", "string", "from", "above", "or", "so", "NUMBER", "Note", "this", "be", "just", "a", "quick", "write", "up", "NUMBER", "Please", "don", "t", "take", "it", "as", "be", "NUMBER", "Hi", "Mr", "NUMBER", "Park", "Great", "little", "game", "I", "decided", "to", "provide", "a", "french", "translation", "because", "I", "find", "it", "really", "helpful", "to", "quickly", "grasp", "key", "concepts", "of", "the", "flex", "box", "model", "and", "thought", "it", "might", "help", "some", "students", "around", "here", "were", "it", "translated", "NUMBER", "Here", "be", "all", "of", "my", "change", "Localize", "everything", "to", "french", "Add", "localization", "in", "a", "new", "script", "file", "for", "unlocalized", "strings", "Reset", "and", "its", "warning", "message", "Change", "all", "html", "file", "to", "include", "this", "new", "script", "file", "Change", "root", "html", "file", "to", "link", "to", "french", "translation", "Fix", "unclosed", "p", "tag", "in", "all", "languages", "in", "level", "order", "NUMBER", "NUMBER", "The", "froggies", "be", "a", "bit", "fuzzy", "on", "my", "monitor", "since", "they", "re", "PNGs", "NUMBER", "These", "little", "buddies", "be", "perfect", "for", "SVG", "composed", "of", "simple", "shapes", "and", "flat", "colors", "NUMBER", "It", "ll", "make", "the", "filesize", "a", "little", "smaller", "too", "NUMBER", "NUMBER", "This", "be", "a", "really", "awesome", "tutorial", "good", "job", "thanks", "so", "much", "The", "only", "suggestion", "be", "warming", "up", "to", "level", "NUMBER", "combined", "concepts", "especially", "wrap", "reverse", "NUMBER", "That", "s", "pretty", "intense", "Figure", "out", "that", "transform", "scale", "NUMBER", "NUMBER", "works", "as", "a", "replacement", "for", "flex", "wrap", "wrap", "reverse", "NUMBER", "Only", "for", "this", "example", "as", "it", "s", "symmetrical", "NUMBER", "Honestly", "I", "had", "to", "cheat", "look", "at", "code", "LINK", "pages", "js", "levels", "NUMBER", "js", "L", "NUMBER", "tongue", "Solve", "them", "all", "Very", "nice", "play", "with", "the", "frogs", "NUMBER", "These", "ex", "will", "be", "played", "plenty", "of", "times", "Yeah", "considering", "that", "no", "level", "prior", "to", "level", "NUMBER", "has", "you", "use", "wrap", "reverse", "it", "s", "just", "mention", "in", "the", "explanatory", "text", "without", "having", "the", "user", "try", "it", "I", "think", "it", "s", "a", "little", "too", "abrupt", "NUMBER", "All", "that", "s", "needed", "be", "an", "additional", "level", "after", "the", "introduction", "of", "flex", "wrap", "that", "demonstrates", "wrap", "reverse", "interactively", "NUMBER", "Also", "it", "wouldn", "t", "hurt", "to", "have", "a", "little", "buildup", "combining", "a", "few", "of", "the", "concepts", "before", "the", "final", "one", "including", "one", "or", "two", "that", "combine", "order", "with", "things", "like", "flex", "wrap", "NUMBER", "NUMBER", "Agreed", "NUMBER", "I", "think", "this", "would", "be", "be", "better", "with", "some", "more", "exercises", "NUMBER", "My", "brain", "went", "_Woh", "_", "when", "I", "get", "to", "NUMBER", "I", "m", "glad", "to", "find", "part", "of", "the", "answer", "here", "NUMBER", "This", "be", "a", "fantastic", "tutorial", "that", "still", "has", "so", "much", "more", "potential", "NUMBER", "I", "think", "as", "a", "learning", "site", "a", "_boss", "level_", "shows", "its", "weaknesses", "rather", "than", "what", "it", "can", "do", "for", "the", "student", "NUMBER", "A", "number", "of", "exercises", "up", "to", "the", "_boss", "level_", "would", "really", "reinforce", "the", "concepts", "and", "make", "them", "masters", "NUMBER", "NUMBER", "tempted", "to", "fork", "and", "add", "some", "myself", "NUMBER", "Yeah", "I", "didn", "t", "even", "know", "wrap", "reverse", "existed", "until", "I", "gave", "up", "and", "came", "here", "via", "the", "github", "link", "on", "the", "site", "NUMBER", "I", "didn", "t", "think", "want", "to", "google", "for", "an", "answer", "since", "I", "thought", "I", "was", "taught", "everything", "I", "needed", "to", "know", "to", "complete", "the", "problem", "SergiOnGit", "Here", "s", "what", "I", "ended", "up", "with", "after", "learning", "about", "wrap", "reverse", "css", "flex", "flow", "column", "reverse", "wrap", "reverse", "justify", "content", "center", "align", "content", "space", "between", "I", "think", "having", "a", "wrap", "reverse", "exercise", "somewhere", "before", "level", "NUMBER", "would", "ease", "the", "learning", "curve", "here", "NUMBER", "NUMBER", "seems", "ok", "for", "me", "NUMBER", "ghost", "thanks", "for", "the", "solution", "NUMBER", "I", "was", "not", "able", "to", "find", "it", "by", "myself", "NUMBER", "Not", "sure", "to", "understand", "why", "be", "it", "the", "solution", "NUMBER", "Maybe", "provide", "solution", "with", "explanations", "could", "be", "useful", "in", "the", "game", "I", "agree", "NUMBER", "hit", "as", "a", "bit", "of", "a", "shock", "but", "it", "forced", "me", "to", "find", "the", "answer", "elsewhere", "and", "in", "the", "process", "find", "other", "resources", "NUMBER", "css", "flex", "flow", "column", "wrap", "justify", "content", "center", "align", "content", "space", "between", "transform", "scale", "NUMBER", "NUMBER", "Upside", "down", "work", "too", "stuck_out_tongue_winking_eye", "Besides", "the", "wrap", "reverse", "the", "true", "value", "of", "level", "NUMBER", "be", "I", "now", "know", "that", "with", "one", "class", "you", "can", "do", "so", "much", "NUMBER", "Otherwise", "I", "will", "apply", "other", "class", "for", "the", "children", "NUMBER", "haha", "NUMBER", "Really", "thanks", "NUMBER", "I", "agree", "that", "level", "NUMBER", "be", "pretty", "tough", "but", "I", "intended", "it", "to", "be", "like", "that", "to", "give", "the", "opportunity", "to", "play", "around", "with", "all", "of", "the", "properties", "one", "last", "time", "and", "as", "a", "boss", "level", "final", "challenge", "to", "add", "a", "sense", "of", "accomplishment", "NUMBER", "I", "like", "the", "concept", "of", "having", "a", "boss", "level", "but", "I", "think", "there", "need", "to", "be", "just", "a", "few", "free", "form", "exercises", "leading", "up", "to", "it", "NUMBER", "flex", "direction", "column", "reverse", "flex", "wrap", "wrap", "reverse", "justify", "content", "center", "align", "content", "space", "between", "I", "like", "it", "NUMBER", "If", "you", "can", "depict", "direction", "too", "you", "can", "differentiate", "row", "from", "row", "reverse", "NUMBER", "Not", "sure", "how", "it", "can", "be", "implement", "and", "will", "have", "to", "make", "sure", "the", "aesthetics", "fit", "and", "aren", "t", "too", "distracting", "but", "I", "m", "definitely", "keen", "on", "the", "idea", "NUMBER", "Initially", "I", "was", "thinking", "to", "use", "the", "waves", "but", "I", "agree", "with", "you", "Tom", "might", "be", "distracting", "and", "too", "much", "NUMBER", "What", "about", "ripples", "from", "below", "the", "leafs", "spreading", "towards", "the", "current", "direction", "I", "should", "make", "some", "visuals", "to", "explain", "that", "NUMBER", "Coming", "soon", "Hey", "NUMBER", "Here", "would", "visualising", "the", "axis", "direction", "as", "ripples", "on", "the", "water", "help", "people", "realise", "the", "difference", "between", "normal", "and", "reverse", "ripledirection", "NUMBER", "LINK", "a", "NUMBER", "c", "NUMBER", "NUMBER", "e", "NUMBER", "NUMBER", "a", "NUMBER", "e", "NUMBER", "b", "NUMBER", "fc", "NUMBER", "d", "NUMBER", "b", "NUMBER", "jpg", "Glad", "you", "like", "it", "had", "few", "other", "options", "but", "this", "one", "as", "you", "said", "be", "the", "most", "subtle", "one", "NUMBER", "I", "was", "hoping", "the", "ripples", "could", "be", "animated", "out", "of", "the", "leaf", "in", "the", "direction", "of", "the", "axis", "and", "disappearing", "gradually", "NUMBER", "Regarding", "the", "space", "when", "the", "leaf", "be", "close", "to", "the", "edge", "could", "we", "add", "a", "bit", "more", "say", "NUMBER", "NUMBER", "px", "of", "padding", "to", "just", "show", "the", "ripples", "animating", "out", "towards", "the", "edge", "What", "do", "you", "think", "Could", "that", "work", "On", "Fri", "NUMBER", "Dec", "NUMBER", "at", "NUMBER", "NUMBER", "Thomas", "Park", "notifications", "github", "NUMBER", "com", "write", "Visually", "it", "looks", "great", "NUMBER", "Fits", "with", "the", "style", "and", "it", "s", "visible", "but", "subtle", "NUMBER", "Not", "sure", "how", "it", "would", "work", "when", "there", "s", "no", "space", "like", "when", "a", "lilypad", "be", "on", "the", "edge", "of", "the", "pond", "or", "there", "be", "multiply", "lilypads", "lined", "up", "NUMBER", "Also", "wondering", "how", "to", "best", "implement", "it", "NUMBER", "Perhaps", "grab", "the", "computed", "style", "for", "each", "lilypad", "then", "apply", "a", "class", "based", "on", "each", "s", "flex", "direction", "NUMBER", "Reply", "to", "this", "email", "directly", "or", "view", "it", "on", "GitHub", "LINK", "issuecomment", "NUMBER", "NUMBER", "This", "be", "to", "fix", "a", "mistake", "I", "made", "when", "I", "translated", "to", "pt", "br", "NUMBER", "Great", "Job", "this", "be", "awesome", "NUMBER", "I", "think", "your", "should", "require", "semicolons", "in", "order", "to", "to", "solve", "the", "levels", "or", "at", "least", "a", "warning", "NUMBER", "Thanks", "I", "m", "also", "interested", "in", "the", "semicolon", "deal", "new", "programmers", "and", "veterans", "alike", "tend", "to", "accidentally", "leave", "out", "semicolons", "NUMBER", "If", "not", "a", "requirement", "then", "a", "helpful", "reminder", "that", "the", "person", "forgot", "would", "be", "helpful", "in", "the", "development", "of", "programmers", "learning", "from", "flexbox", "froggy", "NUMBER", "This", "pull", "request", "include", "the", "German", "translation", "NUMBER", "This", "be", "work", "in", "progress", "so", "don", "t", "merge", "right", "away", "NUMBER", "The", "level", "strings", "be", "miss", "NUMBER", "I", "will", "update", "this", "as", "soon", "as", "possible", "NUMBER", "thomaspark", "you", "re", "welcome", "NUMBER", "Thank", "you", "for", "this", "entertaining", "and", "yet", "educational", "piece", "of", "web", "technology", "NUMBER", "I", "m", "do", "with", "translating", "by", "the", "way", "NUMBER", "Hi", "I", "just", "finished", "the", "translation", "NUMBER", "This", "be", "my", "first", "PR", "let", "me", "know", "if", "I", "made", "any", "mistake", "NUMBER", "Now", "that", "styles", "be", "auto", "applied", "it", "would", "be", "beneficial", "to", "have", "some", "type", "of", "indication", "that", "the", "style", "be", "invalid", "NUMBER", "Otherwise", "the", "learner", "be", "left", "confused", "on", "why", "their", "style", "be", "not", "be", "applied", "NUMBER", "For", "example", "a", "incorrect", "style", "that", "looks", "correct", "on", "first", "glance", "flex", "direction", "row", "reversed", "An", "error", "I", "make", "all", "too", "much", "NUMBER", "A", "problem", "like", "that", "would", "be", "solve", "by", "some", "type", "of", "indicator", "that", "a", "line", "in", "invalid", "NUMBER", "Perhaps", "an", "icon", "to", "the", "right", "of", "the", "invalid", "line", "I", "did", "notice", "that", "the", "next", "button", "change", "state", "but", "I", "wonder", "if", "that", "be", "too", "subtle", "of", "a", "feedback", "NUMBER", "Especially", "for", "beginners", "NUMBER", "Which", "be", "why", "I", "think", "some", "way", "of", "highlight", "the", "offending", "line", "would", "be", "helpful", "NUMBER", "Redraw", "the", "frogs", "and", "improve", "a", "little", "color", "and", "the", "contrast", "between", "them", "and", "the", "background", "like", "the", "colors", "better", "code", "editor", "NUMBER", "Hi", "thomaspark", "these", "be", "the", "change", "before", "after", "D", "flexboxfroggy", "change", "LINK", "NUMBER", "NUMBER", "e", "NUMBER", "NUMBER", "b", "NUMBER", "dac", "NUMBER", "b", "NUMBER", "c", "NUMBER", "png", "I", "was", "going", "to", "suggest", "SVG", "to", "create", "sharper", "images", "but", "I", "was", "beaten", "too", "it", "smile", "However", "could", "I", "suggest", "that", "svg", "if", "implement", "keep", "the", "png", "file", "as", "a", "fallback", "for", "visitors", "with", "browsers", "that", "don", "t", "support", "svg", "NUMBER", "The", "technique", "be", "outlined", "here", "LINK", "tricks", "NUMBER", "com", "a", "complete", "guide", "to", "svg", "fallbacks", "under", "Fallback", "for", "SVG", "ass", "CSS", "background", "image", "and", "the", "code", "would", "look", "like", "CSS", "NUMBER", "lilypad", "NUMBER", "green", "NUMBER", "bg", "background", "image", "url", "NUMBER", "images", "lilypad", "green", "NUMBER", "png", "background", "url", "NUMBER", "images", "lilypad", "green", "NUMBER", "svg", "linear", "gradient", "transparent", "transparent", "Happy", "to", "provide", "a", "pull", "request", "if", "when", "implement", "NUMBER", "Totally", "love", "this", "game", "by", "the", "way", "patrickgrey", "Is", "there", "such", "a", "browser", "that", "doesn", "t", "support", "SVG", "but", "support", "flexboxes", "I", "m", "just", "wondering", "why", "one", "would", "bother", "to", "have", "a", "fallback", "in", "case", "SVG", "be", "unavailable", "when", "use", "an", "even", "newer", "technology", "as", "the", "core", "of", "the", "game", "NUMBER", "Compatibility", "tables", "for", "reference", "SVG", "support", "table", "LINK", "feat", "svg", "Flexbox", "support", "table", "LINK", "feat", "flexbox", "For", "level", "NUMBER", "NUMBER", "use", "flex", "direction", "column", "or", "flex", "direction", "column", "reverse", "has", "the", "same", "effect", "in", "terms", "of", "frog", "lilypad", "color", "matches", "but", "only", "the", "former", "be", "accepted", "as", "a", "correct", "answer", "NUMBER", "Awesome", "It", "s", "a", "great", "game", "thanks", "for", "make", "it", "NUMBER", "Instead", "of", "having", "to", "press", "submit", "every", "time", "to", "apply", "the", "styles", "and", "check", "your", "work", "NUMBER", "It", "would", "be", "beneficial", "if", "the", "styles", "auto", "applied", "allowing", "the", "learner", "to", "see", "their", "work", "without", "having", "to", "submit", "NUMBER", "Agree", "that", "auto", "applying", "the", "styles", "would", "be", "a", "nice", "addition", "NUMBER", "It", "would", "encourage", "playing", "with", "different", "values", "in", "the", "earlier", "levels", "where", "the", "values", "be", "listed", "NUMBER", "If", "you", "went", "to", "auto", "applied", "styles", "then", "it", "might", "make", "sense", "to", "change", "the", "submit", "button", "to", "a", "next", "button", "disabled", "by", "default", "that", "becomes", "visibly", "enable", "when", "you", "have", "the", "right", "answer", "send", "the", "result", "to", "the", "ENTER", "key", "NUMBER", "D", "When", "you", "hover", "over", "align", "self", "in", "level", "NUMBER", "the", "help", "text", "reads", "Aligns", "a", "flex", "item", "along", "the", "main", "axis", "overriding", "the", "align", "items", "value", "NUMBER", "If", "I", "m", "not", "mistaken", "align", "self", "aligns", "an", "item", "along", "the", "cross", "axis", "just", "like", "align", "items", "do", "NUMBER", "Hi", "Thomas", "Flexbox", "Froggy", "be", "insane", "it", "s", "really", "good", "NUMBER", "I", "d", "like", "to", "help", "with", "the", "Spanish", "translation", "Do", "you", "think", "it", "s", "possible", "Nice", "I", "can", "help", "with", "the", "Brazilian", "Portuguese", "translation", "NUMBER", "smile", "thomaspark", "sounds", "good", "Soon", "I", "ll", "start", "the", "translations", "NUMBER", "How", "to", "reproduce", "bug", "NUMBER", "Complete", "any", "level", "NUMBER", "NUMBER", "NUMBER", "_Quickly_", "go", "to", "next", "level", "it", "works", "even", "after", "frogs", "begin", "to", "move", "a", "bit", "NUMBER", "Wait", "a", "bit", "NUMBER", "Level", "be", "automatically", "completed", "NUMBER", "_", "Aside", "Thanks", "for", "this", "project", "_", "Allow", "pressing", "Ctrl", "and", "the", "Return", "key", "at", "any", "point", "to", "run", "the", "code", "in", "the", "editor", "instead", "of", "having", "to", "click", "submit", "or", "use", "up", "all", "lines", "and", "press", "Return", "NUMBER", "Like", "this", "No", "problem", "thank", "you", "for", "a", "great", "resource", "I", "think", "it", "s", "unreasonable", "to", "expect", "anyone", "to", "memorize", "all", "of", "the", "properties", "and", "their", "values", "in", "time", "it", "takes", "to", "go", "through", "first", "NUMBER", "steps", "NUMBER", "It", "ends", "up", "be", "quite", "frustrating", "to", "break", "one", "s", "train", "of", "thought", "and", "state", "because", "one", "has", "to", "go", "back", "and", "look", "up", "property", "or", "value", "one", "might", "try", "NUMBER", "NUMBER", "NUMBER", "Game", "state", "be", "retained", "but", "the", "mental", "state", "be", "not", "NUMBER", "Every", "time", "i", "switch", "away", "I", "d", "have", "to", "remember", "what", "it", "be", "that", "I", "m", "trying", "to", "do", "and", "since", "most", "properties", "be", "scattered", "across", "levels", "and", "there", "s", "no", "clear", "indication", "which", "level", "has", "which", "property", "it", "turns", "into", "an", "unnecessary", "hunt", "NUMBER", "Learning", "be", "not", "supposed", "to", "be", "frustrating", "this", "be", "not", "high", "school", "D", "I", "wonder", "if", "having", "the", "properties", "not", "initially", "shown", "but", "showable", "be", "a", "better", "idea", "NUMBER", "Part", "of", "what", "I", "ve", "be", "looking", "for", "in", "a", "tutorial", "be", "having", "to", "memorize", "the", "names", "and", "effect", "of", "properties", "NUMBER", "As", "an", "aside", "can", "I", "just", "say", "that", "I", "_really_", "_really_", "like", "this", "tutorial", "EDIT", "After", "completing", "the", "tutorial", "I", "did", "end", "up", "write", "down", "the", "elements", "on", "a", "piece", "of", "paper", "NUMBER", "I", "suggest", "just", "make", "a", "legend", "that", "shows", "somewhere", "after", "the", "property", "has", "be", "introduce", "and", "user", "can", "see", "values", "NUMBER", "I", "had", "to", "look", "this", "up", "by", "going", "back", "a", "few", "levels", "after", "I", "get", "to", "level", "NUMBER", "The", "legend", "for", "quick", "lookup", "would", "be", "really", "helpful", "I", "agree", "with", "d", "NUMBER", "Having", "some", "sort", "of", "reference", "that", "be", "there", "only", "if", "the", "learner", "needs", "it", "would", "be", "helpful", "NUMBER", "I", "think", "a", "popover", "reference", "would", "be", "better", "then", "a", "tooltip", "reference", "as", "it", "requires", "more", "a", "little", "more", "work", "for", "the", "learner", "to", "view", "it", "and", "thus", "would", "encourage", "them", "not", "to", "overuse", "it", "NUMBER", "NUMBER", "for", "a", "newcomer", "like", "me", "that", "last", "level", "be", "a", "pain", "having", "to", "go", "back", "through", "all", "different", "levels", "to", "access", "the", "docs", "NUMBER", "Sure", "people", "could", "search", "for", "these", "docs", "elsewhere", "on", "the", "Web", "but", "people", "be", "lazy", "and", "it", "s", "sad", "loosing", "them", "because", "of", "that", "NUMBER", "Game", "state", "be", "retained", "but", "the", "mental", "state", "be", "not", "This", "so", "much", "NUMBER", "I", "appreciated", "the", "boss", "fight", "ending", "of", "the", "last", "level", "NUMBER", "It", "was", "a", "real", "challenge", "NUMBER", "Great", "game", "Might", "be", "in", "the", "minority", "but", "I", "actually", "liked", "this", "because", "it", "get", "me", "to", "go", "to", "MDN", "and", "look", "up", "the", "properties", "like", "I", "would", "have", "in", "real", "life", "LINK", "US", "docs", "Web", "CSS", "flex", "flow", "LINK", "US", "docs", "Web", "CSS", "flex", "wrap", "Maybe", "add", "a", "link", "to", "look", "up", "documentation", "instead", "NUMBER", "to", "cecyc", "It", "be", "always", "valuable", "to", "make", "sure", "new", "devs", "know", "about", "MDN", "NUMBER", "w", "NUMBER", "schools", "be", "damned", "Missing", "word", "add", "NUMBER", "amazing", "little", "project", "by", "the", "way", "So", "I", "assume", "NUMBER", "be", "the", "correct", "answer", "for", "the", "order", "however", "entering", "NUMBER", "or", "NUMBER", "works", "too", "oh", "I", "see", "thanks", "Hi", "Congratulations", "for", "this", "excellent", "project", "gift", "I", "made", "it", "to", "the", "last", "lvl", "NUMBER", "of", "NUMBER", "but", "didn", "t", "notice", "the", "validation", "message", "You", "win", "Thanks", "to", "your", "mastery", "of", "flexbox", "you", "were", "able", "to", "bring", "all", "of", "the", "frogs", "to", "safety", "NUMBER", "for", "I", "was", "focused", "on", "the", "frogs", "themselves", "in", "the", "right", "pane", "NUMBER", "It", "could", "be", "nice", "add", "a", "little", "completion", "animation", "when", "the", "game", "be", "over", "NUMBER", "Excellent", "None", "of", "the", "exist", "levels", "be", "use", "flex", "grow", "or", "flex", "shrink", "NUMBER", "It", "may", "be", "a", "good", "idea", "to", "use", "these", "more", "advance", "features", "too", "it", "may", "be", "harder", "to", "visualize", "them", "with", "frogs", "though", "Yup", "would", "be", "really", "nice", "NUMBER", "Good", "job", "NUMBER", "i", "imagine", "it", "would", "be", "frogs", "be", "wide", "or", "slim", "following", "this", "example", "LINK", "Appreciate", "more", "exercises", "on", "align", "content", "and", "align", "items", "to", "really", "show", "the", "difference", "NUMBER", "Could", "draw", "inspiration", "from", "the", "story", "of", "Tiddalik", "the", "Frog", "LINK", "NUMBER", "In", "the", "telling", "of", "the", "myth", "Tiddalik", "awoke", "one", "morning", "with", "an", "unquenchable", "thirst", "and", "began", "to", "drink", "until", "all", "the", "fresh", "water", "was", "greedily", "consumed", "NUMBER", "Having", "one", "frog", "drink", "much", "of", "the", "water", "and", "grow", "could", "be", "a", "good", "background", "for", "why", "the", "frogs", "be", "growing", "shrinking", "NUMBER", "definitely", "it", "would", "be", "really", "nice", "to", "have", "some", "levels", "for", "flex", "grow", "flex", "shrink", "and", "flex", "basis", "and", "their", "shorthand", "NUMBER"], "text_count": [0, 2617, 548, 230, 125, 8, 147, 1, 29, 316, 429, 700, 400, 297, 303, 55, 0, 0, 0, 0, 876, 260, 132, 79, 135, 153, 0, 0, 0, 0, 1457, 945, 527, 16, 297, 111, 0, 0, 0, 0, 2098, 14, 982, 847, 644, 0, 0, 0, 0, 0, 540, 239, 242, 130, 199, 101, 167, 0, 0, 0, 1379, 186, 1040, 84, 0, 0, 0, 0, 0, 0, 962, 95, 682, 251, 135, 0, 0, 0, 0, 0, 1906, 982, 143, 710, 111, 41, 0, 0, 0, 0, 172, 498, 46, 0, 0, 0, 0, 0, 0, 0, 1417, 246, 894, 268, 0, 0, 0, 0, 0, 0, 2432, 5080, 76, 219, 69, 120, 0, 0, 0, 0, 7516, 26, 5787, 63, 1338, 1519]}]